Repository: Crasader/GLEXP-Team-Chimple-goa
Catalog: goa/Resources/res/lang/swa/swa.po
Languages: sw

source: I would like a towel to dry myself when I come in from the rain
sw: Ningependelea taulo kwaajili ya kujikaushia nikitoka kwenye mvua

source: That is such a soft towel. You can take the lamp
sw: Hilo ni taulo laini. Unaweza chukua kibatari

source: Ask the secretary!!
sw: Muulize Katibu!!

source: I am the cashier. I count the money when people buy grocery
sw: Mimi ni karani wa fedha. Ninahesabu fedha watu wanunuwapo vivywaji na vyakula

source: You must be very good with numbers
sw: Utakua unazijua namba vizuri sana

source: It gets very dark here in the night. Can you get me a lamp?
sw: Kunakua na giza kubwa sana hapa wakati wa usiku. Unaweza kunipatia taa?

source: Now my counter will be bright. You can take a tomato
sw: Sasa Kaunta yangu itang'aa. Unaweza ukachukua nyanya

source: Ask the cashier!!
sw: Muulize karani wa Fedha!!

source: I give tickets to passengers in the bus
sw: Ninawapa abirikia tiketi katika basi

source: You must get to travel a lot
sw: Unatakiwa usafiri sana

source: I am very hungry. Can you get me a tomato?
sw: Nina njaa sana. Unaweza ukanipatia nyanya?

source: That’s a juicy tomato. You can take a newspaper
sw: Hiyo ni juisi ya Nyanya. Unaweza ukachukua gazeti

source: Ask the conductor!!
sw: Muulize kondakta!!

source: I look after everyone in this house
sw: Ninamuangalia kila mmoja katika hii nyumba

source: Everyone looks healthy and happy
sw: Kila mmoja anaonekana ni mwenye afya na furaha

source: I read the newspaper every morning. But I cannot find the newspaper today
sw: Ninasoma gazeti kila asubuh. Lakini siwezi kupata gazeti leo

source: Thanks for the newspaper. You can take the coffee maker
sw: Akhsante kwa gazeti. Unaweza chukua kitengeneza kahawa

source: Ask the mother!!
sw: Muulize mama!!

source: I drive buses from city to city on time every day
sw: Ninaendesha gari kutoka mji mmoja kwenda mwingine kila siku kwa muda sahihi

source: I guess you are very punctual
sw: Ninahisi unaenda na muda sana

source: I like my morning coffee. But my coffee machine is broken
sw: Nina penda kahawa yangu ya asubuhi. Lakini kitengeneza kahawa changu kimeharibika.

source: Excellent! You can take the clock
sw: Vizuri sana! Unaweza ukachukua saa

source: Ask the driver!!
sw: Muulize dereva!!

source: I manage this office
sw: Ninasimamia hii ofisi

source: Everything looks in order. Super job!
sw: Kila kitu kinaonekana kimepangiliwa. Kazi nzuri!

source: I like to do things on time. But my clock is not working
sw: Ninapenda kufanya vitu katika wakati sahihi. Lakini saa yangu haifanyi kazi.

source: Now the office will run like clockwork! You can take the computer
sw: Sasa ofisi itafanya kazi kama saa! Unaweza chukua kompyuta

source: Ask the office!!
sw: Ulizia ofisi!!

source: My shop has every item on the earth
sw: Duka langu lina vitu vyote vilivyopo duniani

source: It is very big
sw: Ni kubwa sana

source: It is so difficult to track of everything. I wish I had a computer
sw: Ni vigumu sana kufuatilia kila kitu. Ninatamani ningekua na kompyuta

source: That’s a speedy computer. You can take the milk
sw: Hiyo ni komyuta yenye kufanya kazi haraka. Unaweza ukachukua maziwa

source: Ask the grocer!!
sw: Muulize muuza vyakula na vinywaji!!

source: My baby has been crying a lot. She must be hungry
sw: Mtoto wangu amekua akilia sana. Atakua ana njaa

source: She is cute
sw: Ni mrembo

source: Can you please get some milk?
sw: Unaweza kunipatia maziwa tafadhali?

source: The milk looks tasty. I am sure my baby will love it. Thank you!
sw: Maziwa yana ladha nzuri. Nina uhakika mwanangu atayapenda. Akhsante!

source: Give the towel to the secretary
sw: Mpe katibu taulo

source: Pick up the lamp
sw: Chukua taa

source: Give the lamp to the cashier
sw: Mpe taa karani wa fedha

source: Pick up the tomato
sw: Chukua nyanya

source: Give the tomato to the bus conductor
sw: Mpe nyanya kondakta wa basi

source: Pick up the newspaper
sw: Chukua gazeti

source: Give the newspaper to the mother
sw: Mpe gazeti mama

source: Pick up the coffee maker
sw: Chukua kitengeneza kahawa

source: Give the coffee maker to the bus driver
sw: Mpe kitengeneza kahawa dereva wa gari

source: Pick up the clock
sw: Chukua saa

source: Give the clock to the officer
sw: Mpe saa Afisa

source: Pick up the computer
sw: Chukua compyuta

source: Give the computer to the grocer
sw: Mpe kompyuta muuza vyakula na vinywaji

source: Pick up the milk
sw: Chukua maziwa

source: Give the milk to the baby
sw: Mpe maziwa mtoto

source: I maintain law and order in the city
sw: Ninadumisha sheria na taratibu katika mji

source: I respect you
sw: Ninakuheshimu

source: You can have the walkie talkie. It is easy to talk to one another
sw: Unawweza ukawa na mazungumzo ya ana kwa ana. Ni rahisi kuongea na kila mmoja

source: Hope to be in touch always
sw: Ni matumaini yangu kuwa sambamba siku zote.

source: I cut, trim and style peoples hair
sw: Nina kata,Nina Punguza na kuweka miundo tofauti ya nywele za watu

source: You are doing a wonderful job
sw: Unafanya kazi nzuri

source: I wish I had a walkie talkie to talk to my friend across the street
sw: Ninatamani ningekua ha mazungumzo na rafiki yangu mtaani

source: Great walkie talkie. You can take the comb
sw: Mazungumzo mazuri. Unaweza ukachukua kitana.

source: Ask the hair stylist!!
sw: Muulize kinyozi!!

source: I brew coffee and serve it to the movie watchers
sw: Ninatengeneza kahawa na kusambaza kwa watizamao sinema

source: Your coffee smells delicious
sw: Kahawa yako inanukia vizuri

source: I wish I had a comb to keep my hair neat
sw: Ninatamani ningekua na kitana kuweka nywele zangu sawa

source: Very sleek comb! You can take a cup of coffee
sw: Kitana kizuri sana. Unaweza kunywa kahawa

source: Ask the waiter!!
sw: Muulize muhudumu!!

source: I am a doctor. I treat sick people
sw: Mimi ni Mganga. Ninaponya wagonjwa

source: Thanks for keeping us all healthy
sw: Akhasante kwa kutuweka wenye afya

source: I am tired working all day. I would love a cup of coffee
sw: Nimechoka kufanya kazi siku nzima. Ningependelea kunywa kahawa

source: Refreshing coffee! You can take the weighting machine
sw: Utengenezwaji kahawa! Unaweza ukachukua Minzani

source: Ask the doctor!!
sw: Muulize muuguzi!!

source: I am in charge of all the weapons here
sw: Mimi ni muhusika wa Silaha zote hapa

source: It is such a challenging duty
sw: Ni kazi yenye changamoto

source: I want everyone here to be fit. I would like to weigh everyone
sw: Ninataka kila mmoja hapa awe Imara. Ningependa kumpa kila mmoja uzito

source: Now we can all check our weight and keep fit. You can take the shield
sw: Sasa tunaweza kupima uzito wetu na kujiweka imara. Unaweza chukua ngao

source: Ask the guard!!
sw: Muulize mlinzi!!

source: I collect tickets when people enter the movie theater
sw: Ninakusanya tiketi wakati watu waingiapo kwenye ukumbi wa sinema

source: It must be tough to handle the crowd
sw: Itakua ngumu kusimamia mkusanyiko

source: Sometimes the crowd gets rough. I would like a shield
sw: Muda mwingine mkusanyiko unavurugika. Ningependelea Ngao

source: Such a strong shield! You can take the poster
sw: Ngao Imara. Unaweza chukua Bango

source: Ask the ticket collector
sw: Muulize mkusanya tiketi

source: I apply make up on women and make them look pretty
sw: Nina waremba wanawake na kuwafanya waonekane warembo

source: You make the world a more beautiful place
sw: Umeifanya dunia sehemu ya kupendeza sana

source: I wish this place was more pretty. A poster on the wall will look good
sw: Ninatamani hii sehemu ingependeza sana. Mtu wa Bango ukutani ataonekana vizuri sana.

source: The poster looks pretty. You can take the beauty cream
sw: Bango limependeza. Unaweza ukachukua Krimu nzuri

source: Ask the beautician!!
sw: Muulize mrembaji!!

source: I look after sick people and nurse them to health
sw: Ninawaangalia wagonjwa na kuwauguza

source: You are such a helpful person
sw: Wewe ni mtu msaidiaji

source: I forgot my face cream. Can you please get it?
sw: Nimesahau krimu ya uso wangu. Unaweza ukaileta?

source: Thanks for the face cream. You can take the medicine
sw: Akhsante kwa krimu ya uso. Unaweza ukachukua dawa.

source: Ask the nurse!!
sw: Muulize muuguzi!!

source: I have come all the way from the village
sw: Nimekuja kutoka kijijini.

source: Why did you come to the city?
sw: Kwanini umekuja mjini?

source: I have to take back medicine for my father
sw: yanipasa kuchukua dawa kwaajili ya baba yangu

source: Now my father will get better. Thank you my friend
sw: Sasa baba yangu atapata ahueni. Akhsante rafiki yangu

source: Give the walkie talkie to the hair stylist
sw: Mpe maelekezo kinyozi

source: Pick up the comb
sw: Chukua kitana

source: Give the comb to the waiter
sw: Mpe kitana muhudumu

source: Pick up the coffee
sw: chukua kahawa

source: Give the coffee to the doctor
sw: Mpe kawaha Mganga

source: Pick up the weighing machine
sw: Chukua Minzani

source: Give the weighing machine to the guard
sw: Mpe Minzania mlinzi

source: Pick up the shield
sw: Chukua Ngao

source: Give the shield to the ticket collector
sw: mpe ngao mkusanya tiketi

source: Pick up the poster
sw: Chukua Bango

source: Give the poster to the beautician
sw: Mpe bango mrembaji

source: Pick up the face cream
sw: Chukua krimu ya uso

source: Give the face cream to the nurse
sw: Mpe krimu ya uso muuguzi

source: Pick up the medicine
sw: Chukua dawa

source: Give the medicine to the villager
sw: Mpe dawa mwanakijiji

source: I am the waiter. How may I help you?
sw: Mimi ni muhudumu. Ninaweza kukusaidiaje?

source: I just wanted to tell you what a good job you are doing
sw: Nilitaka kukuambia kazi gani nzuri ufanyayo!

source: Thank you! You can have a plate
sw: Akhasante!. Unaweza ukala

source: Have a happy lunch with your plate
sw: mlo mwema katika chakula chako

source: I love to study
sw: Ninapenda kusoma

source: You must do good in school and become great one day
sw: Yakupasa kufanya vyema katika masomo yako ili uje kuwa mtu mkubwa siku moja

source: I am hungry but I forgot my plate
sw: Nina njaa lakini nimesahau sahani yangu.

source: That’s a clean plate. You can take my pencil
sw: Hiyo ni sahani safi. Unaweza ukachukua penseli yangu.

source: Ask the student
sw: Muulize mwanafunzi.

source: I am the coach of the football team
sw: Mimi ni mwalimu wa kikosi cha mpira wa miguu

source: Your team looks very dashing. They must be winning a lot
sw: Kikosi chako kinaonekana kucheza vyema. Lazima ushinde sana

source: I want to write down my strategy. But I cannot find my pencil
sw: Ninataka kuandika Mikakati yangu. Lakini siwezi siioni penseli yangu.

source: Handy pencil! You can take my loud speaker
sw: Penseli nzuri!. Unaweza ukachukua spika zangu

source: Ask the coach!!
sw: Muulize Mwalimu!!

source: I direct the drama. What do you think of it?
sw: Ninaongoza mchezo wa kuigiza. Unafiria nini kuhusu hilo?

source: It is very interesting
sw: Inavutia sana

source: The actors cannot hear me properly from the stage. I wish I had a loudspeaker
sw: Waigizaji hawawezi kunisikia vyemba kutoka jukwaani. Ninatamani ningekua na spika

source: That is a powerful loud speaker. You can take the stool
sw: Hiyo ni spika yenye sauti kubwa. Unaweza chukua Kiti

source: Ask the director!!
sw: Muulize Mganga

source: I cook the food for the customers
sw: Ninapika chakula kwa ajili ya wateja

source: Your food is very tasty
sw: Chakula chako ni kitamu sana.

source: I stand all day. All the chairs are used by customers. I wish I had a stool to sit on
sw: Ninasimama siku nzima. Viti vyote vimekaliwa na wateja. Ninatamani ningekua na stuli ya kukalia.

source: Comfy stool! You can take the apple
sw: Stuli nzuri!. Unaweza ukachukua tofaa

source: Ask the chef!!
sw: Muulize mpishi!

source: I am the main actor of the play
sw: Mimi ni Muigizaji mkuu katika Igizo

source: You are very dynamic
sw: Unabadilika sana

source: I like to think so! I am so hungry I wish I had an apple to eat
sw: Ninapenda kufiria hivyo pia! Nina njaa sana, Nina tamani ningekua na Tofaa la kula

source: Tasty apple! You can take my crown
sw: Tofaa tamu. Unaweza ukachukua taji langu.

source: Ask the actor!!
sw: Muulize Muigizaji!!

source: I am the captain of the football team
sw: Mimi ni kiongozi wa Kikosi cha mpira wa miguu

source: Congratulations on your victory
sw: Hongera kwa ushindi wako.

source: I have to go for the victory march. But I don’t have a crown to wear
sw: Yanipasa kwenda katika mtanange wa ushindi. Lakini sina taji la kuvaa.

source: Sparkling crown! You can take my trophy
sw: taji lenye kung'ara! Chukua Kombe langu.

source: Ask the player!!
sw: Muulize mchezaji!!

source: I love teaching all the children
sw: Ninapenda kuwafundisha watoto wote

source: Your students love you. You are teaching them very well
sw: Wanafunzi wako wanakupenda. Unawafundisha vizuri sana.

source: I am holding a spelling competition. I need a trophy for the winner
sw: Ninashikilia mashindano ya herufi. Ninahitaji kombe kwa ajili ya mshindi.

source: Extraordinary trophy! You can take the globe
sw: Kombe la maajabu. Unaweza ukachukua dunia nzima

source: Ask the teacher!!
sw: Muulize Mwalimu!!

source: I am a sailor. I travel the world on a ship
sw: Mimi ni baharia. Ninasafiri ulimwenguni kwa meli

source: That is very exciting
sw: hiyo ni ya kusisimua

source: I need a globe to chart my trip to the island
sw: Ninahitaji Ramani ya dunia kupangilia safari yangu ya kisiwani

source: That is a detailed globe. Thank you! I can now go on my journey
sw: Hiyo ni ramani ya dunia iliyochambuliwa vyema. Akhsante! Ninaweza kwenda kwenye safari yangu.

source: Give the plate to the student
sw: Mpatie sahani mwanafunzi

source: Pick up the plate
sw: Chukua sahani

source: Give the pencil to the coach
sw: mpatie penseli mwalimu

source: Pick up the loud speaker
sw: Chukua spika yenye sauti kubwa.

source: Give the loud speaker to the director
sw: Mpatie Spika yenye sauti kubwa muongozaji

source: Pick up the stool
sw: Chukua stuli

source: Give the stool to the chef
sw: Mpatie stuli mpishi

source: Pick up the apple
sw: Chukua tofaa

source: Give the apple to the actor
sw: Mpatie tofaa muigizaji

source: Pick up the crown
sw: Chukua taji

source: Give the crown to the player
sw: Mpatie taji mchezaji

source: Pick up the trophy
sw: Chukua kombe

source: Give the trophy to the teacher
sw: Mpatie kombe mwalimu

source: Pick up the globe
sw: Chukua ramani ya dunia

source: Give the globe to the sailor
sw: Mpatie ramani ya dunia baharia

source: I collect tickets at the train station
sw: Ninakusanya tiketi kwenye kituo cha Gari moshi

source: You are doing a great job. All the trains are on schedule
sw: Unafanya kazi nzuri. Gari moshi zote zipo kwenye ratiba

source: You can take my whistle
sw: Unaweza ukachukua kipenga changu

source: The whistle makes a sharp sound. Use it carefully
sw: Kipenda kina sauti kali. Kitumie vizuri.

source: I am the star student of this class
sw: Mimi ni mwanafunzi nyota wa hili darasa.

source: Did you make that poster? It looks very good
sw: Ulitengeneza lile bango? Limependeza sana

source: I want a whistle to signal to my friends. If you get one, I will give you the poster
sw: Ninahitaji kipenga kuwapa ishara marafiki zangu. Kama ukinipatia kipenga kimoja, nitakupatia bango

source: Loud whistle! You can take the poster
sw: Kipenga chenye sauti kubwa! Unaweza ukachukua Bango.

source: I am the trainer at the gym. I help people get fit
sw: Mimi ni mwalimu kwenye sehemu ya mazoezi. Ninawasaidia watu kuwa Imara.

source: You have a very good physique
sw: Una muonekano mzuri sana

source: The walls here look bare. Can you get a poster?
sw: Kuta za hapa hazipo sawa. Unaweza kupata Bango?

source: Nice poster. You can take my weights for exercising
sw: Bango zuri. Unaweza ukachukua minzani yangu kwa ajili ya mazoezi

source: Ask the trainer!!
sw: Muulize Mwalimu!!

source: I safeguard the airport from any danger
sw: Ninalinda Uwanja wa ndege kutoka kwenye hatari yoyote

source: You must be very alert all the time
sw: yakupasa kuwa na tahadhari sana muda wote

source: I must be fit as well. I wish I had my exercise weights with me
sw: lazima niwe Imara pia. Ninatamani ningekua na minzani yangu ya mazoezi

source: Bulky weights! I can exercise now. You can take the suitcase
sw: Uzito mkubwa! Ninaweza kufanya mazoezi sasa. Unaweza ukachukuza begi la suti

source: I teach people to control their bodies using Yoga
sw: Ninafundisha watu kudhibiti miili yao kwa kutumia Yoga

source: Wow! You can twist your body so much
sw: Wao! Unaweza ukazongota sana mwili wako

source: I have to go to a retreat out of town. But I do not have a suitcase to pack my things
sw: Yanipasa kuondoka nje ya mji. Lakini sina begi la kuhifadhia suti niweze kufungashia vitu nvyangu

source: Excellent suitcase! You can take the apple
sw: Begi zuri la kuhifadhia suti! Unaweza ukachukua tofaa

source: Ask the Yoga master!!
sw: Muulize mwalimu wa Yoga.

source: My class has the best students
sw: Darasa langu lina wanafunzi bora

source: All the children look smart
sw: Wanafunzi wangu wanaonekana wasafi

source: It is my lunch time but I forgot my apple
sw: Ni muda wangu wa mlo wa mchana lakini nimesahau tofaa langu

source: Delicious apple! You can take my purple book
sw: Tofaa tamu!. Unaweza ukachukua kitabu changu cha zambarau

source: Ask the teacher
sw: Muulize mwalimu

source: I am the driver of the train
sw: Mimi ni dereva wa gari Moshi

source: You drive such a long and heavy vehicle
sw: Unaendesha gari refu na zito

source: I would like to read something on the journey. A book will be nice
sw: Ningependelea kusoma kitu safarini. Kitabu itakua vyema.

source: Interesting book! You can take my drink
sw: kitabu chenye kuvutia! Unaweza ukachukua kinywaji changu

source: Ask the train driver!!
sw: Muulize Dereva wa Gari moshi!!

source: I fly the plane in the sky
sw: Ninarusha ndege angani

source: That is so cool
sw: Hiyo nzuri sana

source: I get very thirsty during the flight. I wish I had something to drink
sw: Ninapatwa kiu sana nikiwa kwende ndege. Ninataman ningepata kitu cha kunywa

source: Refreshing drink! You can take a ticket on my plane
sw: Kinywaji kizuri!. Unaweza chukua tiketi kwenye ndege yangu

source: Ask the pilot!!
sw: Muulize Rubani!

source: I am a scientist. I want to go to a very important conference
sw: Mimi ni mwanasayansi. Ninahitaji kwenda kwenye mkutano wa muhimu sana.

source: That is excellent. When are you going?
sw: Hiyo ni vizuri sana. Lini unaenda?

source: I am still waiting for my ticket. Can you please go and get my ticket?
sw: Bado ninasubiri tiketi yangu ya ndege. Unaweza kwenda na kunipatia tiketi yangu tafadhali?

source: Speedy ticket! Now I can fly to my conference. Thank you!
sw: Tiketi ya haraka! Sasa naweza kwenda kwenye mkutano wangu. Akhsante!

source: Give the whistle to the student
sw: Mpe Kipenga mwanafunzi

source: Give the poster to the trainer
sw: Mpe Bango mkufunzi

source: Pick up the weights
sw: Chukua uzito

source: Give the weights to the guard
sw: Mpe uzito ulinzi

source: Pick up the suitcase
sw: Chukua begi la suti

source: Give the suitcase to the Yoga
sw: Mpe begi la suti mtu wa Yoga

source: Pick up the item
sw: Chukua vitu

source: Give the item to the nextperson
sw: Mpe vitu mtu anayefuata

source: Find the Basket
sw: Tafuta kikapu

source: Give this basket to Store Keeper
sw: Mpe kikapu mtunza ghala

source: PIck up the Mango
sw: Chukua Embe

source: Give the Mango to Worker
sw: Mpe Embe mfanyakazi

source: Pick up the Saw
sw: Chukua Msumeno

source: Give the Saw to the Painter
sw: Mpe Msumeno mpaka rangi

source: Pick up the Shovel
sw: Chukua Koleo

source: Give the Shovel to the Farmer
sw: Mpe koleo mkulima

source: Give the Sugar to Watchman
sw: Mpe sukari mlinzi

source: Give the Milk to the Lady
sw: Mpe Maziwa msichana

source: Pick up the Painting
sw: Chukua rangi

source: GIve the Painting to the Milk Man
sw: Mpe rangi mtu wa maziwa

source: Pick up the Flower Vase
sw: Chukua chungu cha maua

source: Give the Flower Vase to the Mechanic
sw: Mpe chungu cha maua fundi

source: Give the lantern to the model
sw: mpe taa

source: Give the camera to the football player
sw: Mpe kamera mcheza mpira

source: Give the ladder to the shop keeper
sw: Mpe ngazi mtunza duka

source: Pick up the ladder
sw: Chukua ngazi

source: Pick up the camera
sw: Chukua kamera

source: Give the food to the photographer
sw: Mpe chakula mpiga picha

source: Pick up the green dress
sw: Chukua nguo ya kijani

source: Give the green dress to the gym owner
sw: Mpe nguo ya kijani mmiliki wa sehemu ya mazoezi

source: Pick up the red purse
sw: Chukua mfuko wa fedha mwekundu

source: Give the red purse to the camp director
sw: Mpe mfuko wa fedha mwekundu kiongozi wa kambi

source: Give the green dress to gym owner
sw: Mpe nguo ya kijani mmiliki wa sehemu ya mazoezi

source: Pick up the rope
sw: Chukua kamba

source: Give the boxing gloves to the cowboy
sw: Mpe kinga za vidole, za masumbwi kijana wa ng'ombe

source: Give the rope to the tailor
sw: Mpe kamba mshonaji

source: Pick up the food
sw: Chukua chakula

source: All your ice creams looks yummy
sw: Aisikrimu zako zote zinaonekana tamu

source: Already in Bag!!
sw: Tayari kwenye begi!!

source: Ask cowboy!!!
sw: Muulize Mtunza Ng'ombe!!!

source: Ask Tailor!!!
sw: Muulize Mshanaji!!!

source: Ask the ice cream vendor
sw: Muulize muuza Aisikrimu

source: Ask the person
sw: Muulize Mtu

source: But I want the bank to be safe. We don't have a fire extinguisher in case of fire
sw: Lakini Ninahitaji Benki iwe salama. Hatuna Kizima moto endapo moto ukitokea

source: Cold icecream! You can take my drink
sw: Aiskrimu ya baridi! Unaweza ukachukua kinywaji changu.

source: Congratulations!!! All Tasks are finished
sw: Pongeza!!! Kazi zote zimemalizika

source: Delicious apple! You can take an ice cream
sw: Tofaa tamu! Unaweza ukachukua aiskrimu

source: farmhouse_mainground.csb#barnhouse_door
sw: Uwanja mkuu wa nyumba ya kilimo. Mlango wa ghala

source: Festive balloons You can take my weights for exercising
sw: Maputo ya Sherehe. Unweza ukachukua uzito wangu kwa mazoezi

source: Give Bottle to the Petrol guy
sw: Mpe chupa mtu wa Petrol

source: Give brush to cafe owner
sw: Mpe brashi mmliki wa mgahawa

source: Give Cookie to Electrician
sw: Mpe kuki fundi umeme

source: Give flashlight to miner
sw: Mpe mwangazi mchimbua madini

source: Give helmet to Electric Owner
sw: Mpe kofia mmlikia wa umeme

source: Give Petrol can to train driver
sw: Mpe Galoni la Petrol dereva wa gari moshi

source: Give Shoes to Waiter
sw: Mpe viatu Muhudumu

source: Give the apple to the Actor
sw: Mpe Tofaa muigizaji

source: Give the apple to the ice cream vendor
sw: Mpe Tufaa muuza Aiskrimu

source: Give the balloon to the trainer
sw: Mpe Pulizo Mkufunzi

source: Give the crown to the Player
sw: Mpe taji mchezaji

source: Give the drink to the pilot
sw: Mpe kinywaji Rubani

source: Give the earth globe to the Sailor
sw: Mpe Ramani ya dunia Baharia

source: Give the ice cream to the train driver
sw: Mpe aiskrimu dereva wa gari moshi

source: Give the loud speaker to the Director
sw: Mpe Spika yenye sauti Muongozaji

source: Give the plate to student
sw: Mpe sahani mwananfunzi

source: Give the plate to the photographer
sw: Mpe sahani mpiga picha

source: Give the stool to the Chef
sw: Mpe kigoda mpishi

source: Give the ticket to the scientist
sw: Mpe tiketi mwanasayansi

source: Give the trophy to the Teacher
sw: Mpe kombe mwalimu

source: Give the wire to Painter
sw: Mpe waya mpaka rangi

source: I am enjoying this park with my family
sw: Ninafurahia hii hifadhi na familia yangu

source: I have driven for a long time. I would like to eat an icecream
sw: Nimeendesha kwa muda mrefu. Ningependelea kula aisikrimu
