Repository: Crasader/GLEXP-Team-Chimple-goa
Catalog: goa/Resources/res/lang/swa/swa.po
Languages: sw

source: Enter the correct number on the missing fish. The fishes are arranged according to the multiplication table. If you multiply the top of the column with the left of the row, you will get the correct number.
sw: Ingiza namba sahihi katika samaki waliokosekana. Samaki wamepangwa kulingana na Jedwali la kuzidisha Kama ukizidisha namba ya juu ya safu na mstari wa kushoto. Utapata jibu sahihi

source: Count the number of Starfish and select the correct number.
sw: Hesabu namba ya samakinyota kisha chagua namba sahihi

source: Jump on the correct numbers in order.
sw: Rukia kwenye namba sahihi kwa mpangilio

source: Jump on the correct numbers according to the multiplication tables.
sw: Rukia kwenye namba sahihi kwa kufuata jedwali la kuzidisha

source: Jump on odd numbers.
sw: Rukia kwenye namba witiri

source: Jump on even numbers.
sw: Rukia kwenye namba shufwa

source: Choose the correct number of notes to make it equal to the value shown in the money machine.
sw: Chagua namba sahihi ya hela ya karatasi yenye thamani sawa na hela ya kwenye mashine

source: Fill the pond with the number of fishes shown.
sw: Jaza bwawa kwa idadi ya samaki wanaooneshwa

source: Fill the box with the number of frogs shown.
sw: Jaza bwawa kwa idadi ya vyura wanaooneshwa

source: Write the alphabet shown to make the car drive home.
sw: Andika herufi inayooneshwa kufanya gari liende nyumbani

source: Place the candy on the line according to the number on it.
sw: Weka pipi kwenye mstari kulingana na idadi

source: Write the alphabet shown before the bomb blasts.
sw: Andika herufi inayooneshwa kabla bomu halijalipuka

source: Write the number shown before the bomb blasts.
sw: Andika namba inayooneshwa kabla bomu halijalipuka

source: Write the word shown before the bomb blasts.
sw: Andika neno linalooneshwa kabla bomu halijalipuka

source: Write the plural of the word shown before the bomb blasts.
sw: Andika wingi wa neno lililooneshwa kabla bomu halijalipuka

source: Write the opposite of the word shown before the bomb blasts.
sw: Andika kinyume cha neno lililooneshwa kabla bomu halijalipuka

source: Write the word with the same meaning of the word shown before the bomb blasts.
sw: Andika neno linalofanana na neno linalooneshwa kabla bomu halijalipuka

source: Write the word with the same pronunciation of the word shown before the bomb blasts.
sw: Andika neno linalofanana na neno linalotamkwa kabla bomu halijalipuka

source: Write the alphabet shown on each door to make the animals go.
sw: Andika herufi inayooneshwa katika kila mlango kuwafanya wanyama waende

source: Write the each alphabet of the word on each door to make the animals go.
sw: Andika kila herufi ya neno katika kila mlango kuwafanya wanyama waende

source: Catch the correct alphabet shown above by jumping. Do not catch the wrong alphabet.
sw: Daka herufi sahihi inayooneshwa juu kwa kuruka. Usidake herufi isiyosahihi

source: Choose the correct alphabets to form the word and make your car go fast.
sw: Chagua herufi sahihi kutengeneza neno na kulifanya gari lako liende haraka

source: Shoot the bubble and match the correct letter or number.
sw: Chagua povu na linganisha silabi sahihi na namba sahihi

source: Choose the opposite of the word shown below. If you choose correctly, you get a chance to shoot.
sw: Chagua kinyume cha neno unalooneshwa chini. Kama ukichagua neno sahihi, unapata nafasi ya kushuti

source: Choose the word with the same meaning of the word shown below. If you choose correctly, you get a chance to shoot.
sw: Chagua neno lenye maana sawa na neno linalooneshwa chini. Kama Ukichagua neno sahihi, unapata nafasi ya kushuti

source: Choose the word with the same pronunciation of the word shown below. If you choose correctly, you get a chance to shoot.
sw: Chagua neno lenye maana sawa na linavotamkwa chini. Kama ukichagua neno sahihi, unapata nafasi ya kushuti

source: Spell the word shown by choosing the correct alphabets.
sw: Andika herufi za neno linalooneshwa kwa kuchagua herufi sahihi

source: Spell the plural of the word shown by choosing the correct alphabets.
sw: Andika herufi ya wingi wa neno linalooneshwa kwa kuchagua herufi sahihi

source: Spell the opposite of the word shown by choosing the correct alphabets.
sw: Andika herufi ya kinyume cha neno linalooneshwa kwa kuchagua herufi sahihi

source: Spell the word with the same meaning of the word shown by choosing the correct alphabets.
sw: Andika herufi ya neno lenye maana sawa na neno linaloandikwa chini kwa kuchagua herufi sahihi

source: Spell the word with the same pronunciation of the word shown by choosing the correct alphabets.
sw: Andika herufi ya neno lenye maana sawa na linavotamkwa kwa kuchagua herufi sahihi

source: Join dots of the same color to make the number shown on the right.
sw: Unga nukta za rangi moja kutengeneza namba inayoonyeshwa kulia

source: Count the number of dots with your fingers. Choose the fingers that match the number of dots on the screen.
sw: Hesabu idadi ya nukta kwa vidole vyako. Chagua vidole vinavofanana na idadi ya nukta kwenye kioo

source: Use the finger shown in the beginning to trace the line.
sw: Tumia kidole kinachooneshwa mwanzoni kufuatilia mstari

source: When the ice cream drops on the cup, it will jump according to the number written on it. Place the cups on the line and drop the ice cream so that it bounces and reaches the cone.
sw: Barafu ikianguka kwenye kikombe, itaruka kulingana na namba zilizoandikwa kwenye barafu. Weka vikombe kwenye mstari kisha angusha barafu ili iruke na kufikia kwenye koni.

source: Click on the words in the right order to make a proper sentence.
sw: Bonyeza maneno kwa mpangilio sahihi kuunda sentesi kamili

source: Choose the box with the matching start of the word.
sw: Chagua boksi lenye kufanana na mwanzo wa neno

source: Choose all the verbs in the sentence.
sw: Chagua vitenzi katika sentensi

source: Choose all the nouns in the sentence.
sw: Chagua nomino zote katika sentensi

source: Choose all the pronouns in the sentence.
sw: Chagua viwakilishi vyote katika sentensi

source: Choose all the adverbs in the sentence.
sw: Chagua vielezi vyote katika sentensi

source: Choose all the adjectives in the sentence.
sw: Chagua vivumishi vyote katika sentensi

source: Choose all the prepositions in the sentence.
sw: Chagua vihusishi vyote katika sentensi

source: Choose all the conjuctions in the sentence.
sw: Chagua vishirikishi vyote katika sentensi

source: Choose all the interjections in the sentence.
sw: Chagua vihisishi vyote katika sentensi

source: Choose all the articles in the sentence.
sw: Chaguaa nomino vielezi vyote vya kwenye sentensi

source: Choose the correct alphabets to form the word and see the flowers bloom.
sw: Chagua herufi sahihi kutengeneza neno kisha angalia maua yakiruka

source: Drag the alphabet and put it on the correct cannon.
sw: Chukua herufi kisha iweke kwenye bunduki sahihi

source: Have fun by decorating the alphabet. At the end, take a photo of your alphabet.
sw: Furahia kwa kupamba herufi, mwishoni piga picha ya herufi yako

source: Arrange the Alphabets from bottom to top.
sw: Pangilia herufi kuanzia chini mpaka juu

source: Arrange the blocks in ascending order from bottom to top.
sw: Pangilia vizuizi kuanzia ya kwanza mpaka ya mwisho kutokea chini mpaka juu

source: Arrange the numbers in ascending order from bottom to top.
sw: Pangilia namba kuanzia ya kwanza mpaka ya mwisho kutokea chini mpaka juu

source: Arrange the days of the week in order from bottom to top.
sw: Pangilia siku za wiki kwa mpangilio kutokea chini kwenda juu

source: Arrange the months of the year in order from bottom to top.
sw: Pangilia miezi ya mwaka kwa mpangilio kutokea chini kwenda juu

source: Click on the word with the same meaning of the word shown above to jump. Finish the race quicker than your opponent.
sw: Bonyeza kwenye neno lenye maana sawa na neno unalooneshwa juu ili kuruka. Maliza mbio haraka zaidi ya mpinzani wako.

source: Click on the word with the opposite meaning of the word shown above to jump. Finish the race quicker than your opponent.
sw: Bonyeza kwenye neno lenye maana kinyume na neno unalooneshwa juu ili kuruka. Maliza mbio haraka zaidi ya mpinzani wako.

source: Click on the word with the same pronunciation of the word shown above to jump. Finish the race quicker than your opponent.
sw: Bonyeza kwenye neno lenye maana sawa linavotamkwa juu ili kuruka. Maliza mbio haraka zaidi ya mpinzani wako.

source: Choose the correct alphabets to form the word.
sw: Chagua herufi sahihi kuunda neno

source: Drag the monster to feed the correct alphabet.
sw: Chukua mnyama ili kumlisha herufi sahihi

source: Whack the alphabet monster if it is the same one shown on the upper left.
sw: Jaribu herufi mnyama kama ni sawa na anayeineshwa upande wa kushoto juu.

source: Allow the same alphabet monster given on the board to cross the bridge. If a different monster tries to enter, open the bridge to make the monster fall.
sw: Ruhusu Herufi mnyama uliyepewa ubaoni kuvuka daraja. Kama Mnyama mwingine akijaribu kuingia, Fungua daraja kumuangusha

source: Burst the balloons with the pin so that only the number shown will be left.
sw: Pasua pulizo kwa pini ili namba zinazooneshwa zibaki

source: Click on the word with the same meaning of the word above. When you get all words in a line correct, you win! Bingo!.
sw: Bonyeza kwenye neno lenye maana sawa na neno la juu. Ukipatia maneno yote kwenye mstari, Umeshinda!. Bingo!

source: Click on the word with the opposite meaning of the word above. When you get all words in a line correct, you win! Bingo!.
sw: Bonyeza kwenye neno lenye maana kinyume na neno la juu. Ukipatia maneno yote kwenye mstari, Umeshinda!. Bingo!

source: Click on the word with the same pronunciation of the word above. When you get all words in a line correct, you win! Bingo!.
sw: Bonyeza kwenye neno lenye maana sawa na linavotamkwa la juu. Ukipatia maneno yote kwenye mstari, Umeshinda!. Bingo!

source: Drop the correct alphabet into the empty box to make the given word.
sw: Chukua herufi sahihi kisha weka kwenye boksi tupu kuunda neno ulilopewa

source: Drop the correct alphabet into the empty box to make the word with the same meaning of the given word.
sw: Chukua herufi sahihi kisha weka kwenye boksi tupu kuunda neno lenye maana sawa na neno ulilopewa

source: Drop the correct alphabet into the empty box to make the word with the opposite meaning of the given word.
sw: Chukua herufi sahihi kisha weka kwenye boksi tupu kuunda neno lenye maana kinyume na neno ulilopewa

source: Arrange the tray in ascending order according to the count of milk bottle present in each tray.
sw: Pangilia trei kuaniza ya kwanza mpaka ya mwisho kulingana na hesabu ya chupa zilizopo kwenye kila trei

source: Place the correct vegetable on the weighing machine and calculate the total price of vegetables on the calculator.
sw: Weka mboga sahihi katika minzani kisha kokotoa jumla ya gharama ya mboga kwenye kikokotozi

source: Move the ball to trace the alphabet.
sw: Sogeza pira kufuata herufi

source: Sort the items.
sw: Pangilia vitu

source: Click on the footballs to form the word mentioned on the top.
sw: Bonyeza kwenye mpira kuunda neno lililotajwa juu

source: Match the same words to form a pair.
sw: Linganisha maneno yanayofanana kuunda jozi

source: Catch the words of the given type to make the pilot fly up. Avoid the rocks.
sw: Daka herufi ya aina uliyopewa kumfanya rubani arushe ndege juu. Kwepa miamba

source: Write the alphabet shown above to get the treasure.
sw: Andika herufi unayooneshwa juukupata hazina

source: Pull the handle to prepare pizza and click on the calculator to enter the total number of toppings.
sw: Vuta mkono kuandaa piza kisha bonyeza kikokotozi kuingiza idadi ya zilizopo juu

source: Count the number of objects as shown below by scrolling through the screen and click on calculator to enter the answer.
sw: Hesabu idadi ya vitu kama ilivooneshwa chini kwa kupandisha kupitia kioo kisha bonyeza kwenye kikokotozi kupata jibu

source: Click on the nouns shown above to make a tall cake.
sw: Bonyeza kwenye nomino zinazooneshwa juu kuunda keki ndefu

source: Click on the verbs shown above to make a tall cake.
sw: Bonyeza kwenye vitenzi vinavyooneshwa juu kuunda keki ndefu

source: Click on the adjectives shown above to make a tall cake.
sw: Bonyeza kwenye vivumishi zinavyooneshwa juu kuunda keki ndefu

source: Click on the word with the same meaning of the word in the center.
sw: Bonyeza kwenye neno lenye maana sawa na neno la katikati

source: Click on the word with the opposite meaning of the word in the center.
sw: Bonyeza kwenye neno lenye maana kinyume na neno la katikati

source: Click on the word with the same pronunciation of the word in the center.
sw: Bonyeza kwenye neno linalotamkwa sawa na neno la katikati

source: Click on the same alphabet as the rock in the middle for five times to break the rock.
sw: Bonyeza kwenye herufi moja kama mwamba katikati kwamara tano kuvunja mwamba

source: Make words from the alphabets shown below. Every correct word makes the character jump.
sw: Unda maneno kutoka kwenye herufi zinazooneshwa chini. Kila neno sahihi linafanya muhusika kuruka

source: Choose two cards such that the sum of the animals are equal to the number shown on the board.
sw: Chagua karata mbili ambazo jumla ya wanyama ni sawa na namba zinazooneshwa ubaoni

source: Choose three cards such that the sum of the animals are equal to the number shown on the board.
sw: Chagua karata tatu ambazo jumla ya wanyama ni sawa na namba zinazooneshwa ubaoni

source: Pull the missing steps up to complete the series.
sw: Vutu hatua iliyokosekana juu, kumaliza mlolongo

source: Close the hole in the tank by dragging the same shape from below.
sw: Funga shimo kwenye tanki kwa kuchukua umbo linalolingana kutoka chini

source: Stories
sw: Hadithi

source: Alphabet
sw: Herufi

source: Alphabet Fight
sw: Vita vya herufi

source: Multiply
sw: Zidisha

source: Count the fish
sw: Hesabu samaki

source: Stepping Stones
sw: Mawe yanayopanda

source: Money Machine
sw: Mashine ya fedha

source: Fill the Pond
sw: Jaza bwawa

source: Go Home
sw: Nenda nyumbani

source: Candy Line
sw: Mstari wa pipi

source: Defuse the Bomb
sw: Lipua Bomu

source: Barn Door
sw: Mlango Ghalani

source: Run and Catch
sw: Kimbia kisha daka

source: Drive
sw: Endesha

source: Pop the Bubble
sw: Rusha povu

source: Shoot
sw: Shuti

source: Spelling Owl
sw: Tamka bundi

source: Connect the Dots
sw: Unganisha nukta

source: Number Dots
sw: Nukta namba

source: Trace the Maze
sw: Tafuta Muhindi

source: Drop the Icecream
sw: Angusha barafu

source: Train
sw: Treni

source: Stack the Words
sw: Simamisha neno

source: Feed the Words
sw: Lisha neno

source: Grow the Plants
sw: Kuza mimea

source: Cannon Ball
sw: Bunduki mpira

source: Decorate the Alphabet
sw: Remba herufi

source: Arrange in Order
sw: Panga kwa mpangilio

source: Dash
sw: Nafasi

source: Cat on the Roof
sw: Paka kwenye paa

source: Feed the Monsters
sw: Lisha mnyama

source: Whack a Monster
sw: Kupiga mnyama

source: Cross the Bridge
sw: Vuka daraja

source: Animal Chain
sw: Mnyororo wa mnyama

source: Pop the Balloon
sw: Rusha pulizo

source: Fly Through Clouds
sw: Paa kwenye mawingu

source: Drop
sw: Angusha

source: Chocolate Factory
sw: Kiwanda cha chokoleti

source: Grocery Shop
sw: Duka la vinywaji

source: Trace
sw: Tafuta

source: Sort It
sw: Kupanga

source: Alphabet Football
sw: Mpira wa miguu

source: Memory
sw: Kumbukumbu

source: Fly
sw: Paa

source: Treasure Hunt
sw: Nyumba ya hazina

source: Make a Pizza
sw: Tengeneza piza

source: Spot the Animals
sw: Angalia wanyama

source: Layer the Cake
sw: Panga keki

source: Catch
sw: Kukamata

source: Drums
sw: Ngoma

source: Rock Smash
sw: Vunja mwamba

source: Jump on Words
sw: Rukia maneno

source: Add the Cards
sw: Ongeza karata

source: Arrange the Steps
sw: Panga ngazi

source: Patch the Holes
sw: Ziba mashimo

source: Patch the Wall
sw: Ziba ukuta

source: Sunday
sw: Jumapili

source: Monday
sw: Jumatatu

source: Tuesday
sw: Jumanne

source: Wednesday
sw: Jumatano

source: Thursday
sw: Alhamisi

source: Friday
sw: Ljumaa

source: Saturday
sw: Jumamosi

source: January
sw: Januari

source: February
sw: Februari

source: March
sw: Machi

source: April
sw: Aprili

source: May
sw: Mei

source: June
sw: Juni

source: July
sw: Julai

source: August
sw: Agosti

source: September
sw: Septemba

source: October
sw: Octoba

source: November
sw: Novemba

source: December
sw: Decemba

source: Hello world!
sw: TODO Hello world!

source: title
sw: kichwa cha habari

source: Catch the nouns
sw: Kukamata majina

source: Catch the adjective
sw: Kukamata kivumishi

source: Catch the verb
sw: Kukamata verb

source: Catch the pronouns
sw: Kukamata pronouns

source: Catch the adverbs
sw: Kukamata vielezi

source: Catch the prepositions
sw: Kukamata viunganishi

source: Catch the conjuctions
sw: Kukamata viunganishi

source: Catch the interjections
sw: Kukamata

source: Catch the articles
sw: Kukamata makala

source: Match the opposites
sw: Mechi kinyume

source: Match the same meaning words
sw: Mechi maneno yale yale maana

source: Match the same sounding words
sw: Mechi maneno yale yale sounding

source: How many are there?
sw: Wangapi huko?

source: tree
sw: mti

source: water drop
sw: maji tone

source: air
sw: hewa

source: ambulance
sw: ambalanzi

source: ant
sw: mdudu

source: apple
sw: tofaa

source: apron
sw: eploni

source: arrow
sw: mshale

source: baby
sw: mtoto

source: baby girl
sw: mtoto msichana

source: bag
sw: mfuko

source: ball
sw: mpira

source: bamboo
sw: mianzi

source: banana
sw: ndizi

source: barricade
sw: ua

source: basket
sw: kikapu

source: beadchain
sw: cheni

source: bed
sw: kitanda

source: bedsheet
sw: shuka

source: bee
sw: nyuki

source: beetroot
sw: kiazidamu

source: bench
sw: benchi

source: bird
sw: ndege

source: biscuit
sw: biskuti

source: bluecap
sw: kofia ya blue

source: board
sw: bodi

source: boat
sw: mashua

source: bonfire
sw: motokambi

source: book
sw: kitabu

source: book shelf
sw: kitabu rafu

source: bottle
sw: chupa

source: bow
sw: upinde

source: bowl
sw: bakuli

source: box
sw: sanduku

source: boy
sw: mvulana

source: branch
sw: tawi

source: brick
sw: matofali

source: brinjal
sw: bilinganya

source: broom
sw: ufagio

source: brother
sw: kaka

source: bubble
sw: povu

source: bucket
sw: ndoo

source: buffalo
sw: nyati

source: building
sw: jengo

source: bulb
sw: balbu

source: bus
sw: basi

source: bus board
sw: ubao wa basi

source: busboard
sw: ubao wa basi

source: bush
sw: kichaka

source: butterfly
sw: kipepeo

source: cabbage
sw: kabichi

source: cage
sw: ngome

source: camel
sw: ngamia

source: candle
sw: mshumaa

source: capsicum
sw: hoho

source: car
sw: gari

source: carpet
sw: kapeti

source: carrot
sw: karoti

source: castle
sw: ngome

source: cat
sw: paka

source: caterpillar
sw: mtoto wa kipepeo

source: cave
sw: pango

source: chair
sw: kiti

source: character
sw: tabia

source: chicken
sw: kuku

source: chimpanzeeanzee
sw: sokwe

source: circle
sw: mduara

source: cloth
sw: nguo

source: cloud
sw: wingu

source: clouds
sw: mawingu

source: cock
sw: jogoo

source: coin
sw: sarafu

source: concrete wall
sw: halisi ukuta

source: container
sw: chombo

source: cooker
sw: jiko la

source: corn
sw: mahindi

source: counter
sw: kaunta

source: cow
sw: ng'ombe

source: cradle
sw: utoto

source: crane
sw: jeki

source: crocodile
sw: mamba

source: crocodileodile
sw: mamba

source: crow
sw: jogoo

source: cup
sw: kikombe

source: curtain
sw: pazia

source: curve
sw: upinde

source: cycle
sw: mzunguko

source: deer
sw: kulungu

source: desk
sw: dawati

source: dock
sw: kizimbani

source: dog
sw: mbwa

source: donkey
sw: punda

source: door
sw: mlango

source: dove
sw: njiwa

source: drop
sw: kushuka

source: dry pond
sw: bwawa kavu

source: duck
sw: bata

source: dust
sw: vumbi

source: dust bin
sw: vumbi bin

source: dustbin
sw: chombo cha kuhefadhia uchafu

source: egg
sw: yai

source: elephant
sw: tembo

source: elephant trunk
sw: tembo shina

source: eye
sw: jicho

source: eye drop
sw: dawa ya macho ya matone

source: eyes
sw: macho

source: face
sw: uso

source: father
sw: baba

source: fence
sw: uzio

source: fire
sw: moto

source: fish
sw: samaki

source: fish blowl
sw: blowl samaki

source: fish bowl
sw: bakuli samaki

source: floor
sw: sakafu

source: flower
sw: maua

source: flower pot
sw: sufuria maua

source: fly
sw: kuruka

source: food
sw: chakula

source: football
sw: soka

source: fork
sw: uma

source: fox
sw: mbwa mwitu

source: friend
sw: rafiki

source: frog
sw: chura

source: fruit basket
sw: kikapu matunda

source: fruit table
sw: meza matunda

source: gate
sw: lango

source: germs
sw: wadudu

source: giraffe
sw: twiga

source: girl
sw: msichana

source: glass
sw: kioo

source: goat
sw: mbuzi

source: gorilla
sw: nyani

source: grand mother
sw: bibi

source: grand parents
sw: wazee

source: grapes
sw: zabibu

source: grass
sw: nyasi

source: grass hill
sw: nyasi kilima

source: ground
sw: ardhi

source: hammer
sw: nyundo

source: hand
sw: mkono

source: headring
sw: pete yenye kichwa cha mnyama au mtu

source: heart
sw: moyo

source: helicopter
sw: helikopta

source: hen
sw: kuku

source: hill
sw: kilima

source: hill
sw: kilima

source: hills
sw: milima

source: hippo
sw: kiboko

source: hole
sw: shimo

source: honeycomb
sw: asali

source: horn
sw: pembe

source: horn
sw: pembe

source: house
sw: nyumba

source: hut
sw: kibanda

source: hyena
sw: fisi

source: island
sw: kisiwa

source: jackal
sw: bweha

source: jug
sw: jagi

source: kite
sw: tiara

source: ladder
sw: ngazi

source: lamp
sw: taa

source: land
sw: nchi

source: lead
sw: kusababisha

source: leaf
sw: jani

source: leaves
sw: majani

source: leg
sw: mguu

source: light
sw: mwanga

source: lighting
sw: taa

source: lightning
sw: umeme

source: line
sw: mstari

source: lion
sw: simba

source: lizard
sw: mjusi

source: lock
sw: kufuli

source: log
sw: kuingia

source: machine
sw: mashine

source: magnifying glass
sw: lenzi

source: man
sw: mtu

source: mango
sw: maembe

source: map
sw: ramani

source: mat
sw: mkeka

source: meat
sw: nyama

source: men
sw: wanaume

source: milk
sw: maziwa

source: millipede
sw: majongoo

source: mom
sw: mama

source: monkey
sw: tumbili

source: moon
sw: mwezi

source: mother
sw: mama

source: mound
sw: kifusi

source: mountain
sw: mlima

source: mouth
sw: kinywa

source: mug
sw: kikombe kikubwa

source: nest
sw: kiota

source: net
sw: wavu

source: night
sw: usiku

source: old
sw: umri

source: orange
sw: machungwa

source: ox
sw: ng'ombe

source: painting
sw: uchoraji

source: palm tree
sw: mtende

source: palmtree fruit
sw: matunda mtende

source: pant
sw: chupi

source: paper
sw: karatasi

source: paper boat
sw: karatasi mashua

source: path
sw: njia

source: peacock
sw: Tausi

source: pearls
sw: lulu

source: pencil
sw: kalamu

source: phone
sw: simu

source: pig
sw: nguruwe

source: pigeon
sw: mbaazi

source: pillow
sw: mto

source: plant
sw: kupanda

source: plate
sw: sahani

source: plough
sw: jembe

source: police car
sw: gari la polisi

source: porridge
sw: uji

source: pot
sw: sufuria

source: puddle
sw: dimbwi

source: puff
sw: pafu

source: pumpkin
sw: boga

source: rabbit
sw: sungura

source: rack
sw: kabati

source: raddish
sw: karoti nyeupe

source: rain
sw: mvua

source: rainbow
sw: upinde wa mvua

source: rake
sw: tafuta

source: rat
sw: panya

source: rays
sw: miale

source: redbus
sw: basi jekundu

source: redcap
sw: kofia nyekundu

source: rhino
sw: vifaru

source: rice
sw: mchele

source: river
sw: mto

source: road
sw: barabara

source: rock
sw: mwamba

source: roller
sw: rola

source: rope
sw: kamba

source: sack
sw: gunia

source: sand
sw: mchanga
