Repository: Crasader/GLEXP-Team-Chimple-goa
Catalog: goa/Resources/res/lang/swa/swa.po
Languages: sw

source: club side
sw: upande wa klabu

source: club tile
sw: jina la klabu

source: club wall
sw: ukuta wa klabu

source: clubside
sw: upande wa klabu

source: coach
sw: kochi

source: coal factory
sw: kiwanda cha makaa ya mawe

source: coal truck
sw: gari la makaa ya mawe

source: coat
sw: kitanda

source: coffee machine
sw: mashine ya kahawa

source: comb
sw: kitana

source: commode
sw: choo

source: compact
sw: pamoja

source: conductor
sw: kondakta

source: corn box
sw: boksi

source: cotton
sw: pamba

source: cottons
sw: pamba

source: counter
sw: kaunta

source: crab
sw: kaa

source: crate
sw: kreti

source: cupboard
sw: kabati

source: curton
sw: katoni

source: disco ball
sw: mpira wa disko

source: dj mixer
sw: dj mchanganyaji

source: doctor
sw: Mganga

source: dog house
sw: kibanda cha mbwa

source: door out
sw: Mlango nje

source: door right
sw: Mlango kulia

source: drama
sw: Igizo

source: drama door
sw: Igizo Mlango

source: dramadoor
sw: Igizo Mlango

source: dress
sw: vazi

source: drip stand
sw: Egemeo la dripu

source: driver
sw: Dereva

source: dryer
sw: Kikaushio

source: dumble
sw: nyavu ya mbao

source: dust pan
sw: kizoleo cha taka

source: electric owner
sw: Mmiliki wa Umeme

source: electrical shop
sw: Duka la umeme

source: electrician
sw: Fundi umeme

source: emergency
sw: Dharura

source: employee desk
sw: Dawati la mfanyakazi

source: equipment
sw: Kifaa

source: exit
sw: kutoka

source: fan
sw: feni

source: farm house
sw: Nyumba ya kilimo

source: farm house left
sw: Nyumba ya kilimo kushoto

source: farmer
sw: Mkulima

source: fire house
sw: Nyuma ya Moto

source: fire station
sw: Kituo cha Moto

source: firestation
sw: Kituo cha Moto

source: firestationdoor
sw: mlango wa Kituo cha Moto

source: flame
sw: moto

source: flash light
sw: mwanga

source: floor tile
sw: kigae cha sakafu

source: floor up
sw: sakafu juu

source: floorgrass
sw: sakafu nyasi

source: floorstone
sw: sakafu ya mawe

source: floortile
sw: sakafu ya vigae

source: floortile1
sw: sakafu ya vigawe

source: foreground
sw: mbele

source: foundation
sw: Msingi

source: foundation tile
sw: Msingi Kigae

source: frame
sw: Uso

source: fridge
sw: friji

source: fridge door
sw: Friji Mlango

source: fruit stand
sw: Egemeo la Tunda

source: garden front
sw: Bustani mbele

source: garden side
sw: Bustani pembeni

source: garlic
sw: Kitunguu maji

source: granary
sw: ghala

source: granary door
sw: ghala mlango

source: grape
sw: Zabibu

source: grass desk
sw: Dawati la nyasi

source: grass square
sw: nyasi mraba

source: green button
sw: Batani ya kijani

source: grocer
sw: Muuza chakula

source: grocerycomp
sw: Duka la chakula

source: guard
sw: Linda

source: guru
sw: Mwalimu

source: gym
sw: Sehemu ya mazoezi

source: gym upper
sw: Sehemu ya mazoezi juu

source: gymdoor
sw: Mlango wa sehemu ya mazoezi

source: hair stylist
sw: Muundo wa nywele

source: hand washer
sw: Kiosheo cha mkono

source: handcuffs
sw: pingu

source: handwash
sw: safisha mkono

source: hanger
sw: Kitundikio

source: heart rate monitor
sw: kipima mapigo ya moyo

source: hero
sw: shujaa

source: hero
sw: Shujaa

source: hose
sw: mpira wa maji

source: hospital
sw: hospitali

source: hospital floor
sw: sakafu ya hospitali

source: hospitalbed
sw: kitanda cha hospitali

source: hospitaldoor
sw: mlango wa hospitali

source: hospitallights
sw: taa ya hospitali

source: hospitalside
sw: upande wa hospitali

source: house side
sw: upande wa hospitali

source: houseside
sw: Upande wa nyumba

source: ice cream
sw: Aisikrimu

source: ice cream vendor
sw: Muuza Aisikrimu

source: injection
sw: Sindano

source: jam
sw: Jamu

source: juicer machine
sw: Mashine ya juisi

source: kitchen floor
sw: Sakafu ya jiko

source: kitchen tile
sw: kigae cha jiko

source: lady
sw: Msichana

source: lady bug
sw: Mdudu wa kike

source: lamp post
sw: nguzo ya taa

source: left
sw: kushoto

source: lens
sw: lenzi

source: light
sw: mwanga

source: lights
sw: mwanga

source: lime
sw: ndimu

source: lip gloss
sw: mdomo

source: livingroom floor
sw: sebule

source: locker
sw: loka

source: locker
sw: loka

source: lolipop
sw: pipi ya kijiti

source: lotion
sw: losheni

source: luggage
sw: mzigo

source: main
sw: Kuu

source: mainground
sw: Uwanja Mkuu

source: manger
sw: zizi

source: mascara
sw: Wanja

source: meat fridge
sw: Nyama friji

source: meat stand
sw: Egemeo la Nyama

source: mechanic
sw: Fundi

source: medicalbox
sw: Boksi la dawa

source: menu
sw: Yaliyomo

source: milk man
sw: Mtu wa maziwa

source: miner
sw: Mchimba madini

source: mining supply
sw: Masambazio ya madini

source: mining supply outdoor
sw: Masambazio ya madini

source: mirror
sw: kioo

source: mixer
sw: kichanganyio

source: money exchange counter
sw: kaunta ya kubadilishia fedha

source: monitor
sw: msimamizi

source: mop
sw: fagio

source: movie theatre
sw: ukumbi wa sinema

source: movie theatre door
sw: mlango wa ukumbi wa sinema

source: newsstand
sw: egemeo la habari

source: node
sw: fundo

source: nurse
sw: Muuguzi

source: office
sw: Ofisi

source: office floor
sw: Sakafu ya ofisi

source: office side
sw: upande wa ofisi

source: officer
sw: afisa

source: onion
sw: kitunguu

source: owl
sw: bundi

source: painter
sw: mpaka rangi

source: painting small
sw: upakaji kidogo

source: pan
sw: sufuria

source: paperbag
sw: mfuko wa karatasi

source: patch
sw: kiraka

source: patch blue
sw: kiraka bluu

source: patch red
sw: kiraka chekundu

source: pattern
sw: mfumo

source: pen
sw: kalamu

source: petrol bunk
sw: kituo cha mafuta

source: petrol filler
sw: kituo cha mafuta

source: petrol guy
sw: muuza wa petrol

source: photos
sw: picha

source: picksaw
sw: chukua msumeno

source: picnic
sw: ziara

source: picnic person
sw: Mtu wa ziara

source: pillar
sw: nguzo

source: piller
sw: Nguzo

source: pilot
sw: Rubani

source: pineaple
sw: Nanasi

source: pineapple
sw: Nanasi

source: pistol
sw: Bunguki

source: plates
sw: Sahani

source: player
sw: Mchezaji

source: pole
sw: Nguzo

source: police station
sw: Kituo cha polisi

source: police station door
sw: Mlango wa kituo cha polisi

source: policeman
sw: Polisi wa kiume

source: policestationside
sw: nje ya kituo cha polisi

source: post office
sw: ofisi ya posta

source: post office door
sw: mlango wa ofisi ya posta

source: postman
sw: Msambaza ujumbe

source: potato
sw: Kiazi

source: power house
sw: Nyumba ya Nishati

source: prawn
sw: kamba

source: radish
sw: karoti

source: railway station
sw: kituo cha gari moshi

source: railway station door
sw: Mlango wa kituo cha gari moshi

source: railway station side
sw: Nje ya kituo cha gari moshi

source: receptionist
sw: Mpokeaji

source: red button
sw: Batani nyekundu

source: refrigerator
sw: Friji

source: restaurant
sw: Mgahawa

source: restaurant door
sw: mlango wa mgahawa

source: restaurant side
sw: nje ya Mgahawa

source: rifle
sw: Bunduki

source: right
sw: Kulia

source: road light
sw: Barabara nyepesi

source: roadlight
sw: Barabara nyepesi

source: roadlightd
sw: Barabara nyepesi

source: rode
sw: Nyonga

source: roof tile
sw: Paa la vigae

source: ropes
sw: Kamba

source: sand bag
sw: Mfuko wa mchanga

source: sanitizer
sw: Mbolea

source: school door
sw: Mlango wa shule

source: school mainground
sw: Uwanja Mkuu wa shule

source: schooldoor
sw: Mlango wa shule

source: scientist
sw: Mwanasheria

source: screen
sw: Kioo

source: screw driver
sw: bisibisi

source: seat
sw: Kiti

source: secretary
sw: katibu

source: see saw
sw: bembea

source: seller
sw: muuzaji

source: shadow
sw: Kivuli

source: shell
sw: Gamba

source: shop bag
sw: Mfuko wa Manunuzi

source: shop case
sw: Mfuko wa Manunuzi

source: shop floor
sw: Sakafu ya duka

source: shop step
sw: Ngazi za duka

source: shop surface
sw: Sakafu ya duka

source: shopping
sw: manunuzi

source: shopping door
sw: Mlango wa Manunuzi

source: shopping side
sw: Upande wa Manunuzi

source: shot gun
sw: Bastola

source: shrub
sw: majani

source: sign
sw: alama

source: singer
sw: Muimbaji

source: sink
sw: sinki

source: slab
sw: slabu

source: small chair
sw: kitu kidogo

source: small lamp
sw: taa ndogo

source: small table
sw: meza ndogo

source: spade
sw: jembe

source: spanner
sw: spana

source: spices
sw: viungo

source: spoon
sw: kijiko

source: spray
sw: fukizio

source: stadium
sw: uwanja wa michezo

source: stadium door
sw: mlango wa uwanja wa michezo

source: stairs
sw: Ngazi

source: stand
sw: Egemeo

source: step
sw: Hatua

source: step big
sw: Hatua kubwa

source: steps
sw: Hatua

source: stethoscope
sw: kimipa mapigo ya moyo

source: storage
sw: hifadhi

source: store keeper
sw: Mtunza Ghala

source: straightener
sw: Kinyooshaji

source: strawberry
sw: Tunda stouberi

source: student
sw: Mwanafunzi

source: studio door close
sw: Mlango wa studio umefungwa

source: studio floor
sw: Sakafu ya Studio

source: studio surface
sw: Sakafu ya studio

source: supply keeper
sw: Mtunza Makusanyo

source: surface
sw: Sakafu

source: swing
sw: Zunguka

source: syrup
sw: Dawa ya maji

source: tank
sw: Tanki

source: teller
sw: Mhudumu wa benki

source: ticket collecter
sw: Mkusanya tiketi

source: ticket collector
sw: Mkusanya tiketi

source: ticket stand
sw: Egemeo la Tiketi

source: tile
sw: Kigae

source: tiles
sw: kigae

source: tissue roll
sw: Fimbo ya tishu

source: tissueroll
sw: Fimbo ya tishu

source: toaster
sw: Kibaniko

source: toilet
sw: Choo

source: toilet paper
sw: Karatasi za chooni

source: tool
sw: Kitu

source: toy
sw: Mwanasesere

source: traffic light
sw: Mataa ya barabarani

source: train car
sw: Gari Moshi

source: train driver
sw: Dereva wa gari moshi

source: train engine
sw: Injini ya gari moshi

source: train station
sw: kituo cha gari moshi

source: train stop
sw: Gari Moshi simama

source: train track
sw: Gari Moshi

source: trainer
sw: Mkufunzi

source: trash can
sw: galoni la Uchafu

source: tread mill
sw: Mashine ya mazoezi

source: tree house
sw: Nyumba ya mti

source: treehouse
sw: Nyumba ya mti

source: trial room
sw: Chumba cha majaribisho

source: tripod
sw: Traipodi

source: trolley
sw: toroli

source: upper floor
sw: sakafu ya juu

source: villager
sw: Mwanakijiji

source: villager
sw: Mwanakijiji

source: waiter
sw: Muhudumu

source: wall hanger
sw: Ukuta kitundikio

source: wall plate
sw: Ukuta sahani

source: wall texture
sw: ukuta urembo

source: wall tile
sw: Ukuta kigae

source: wallclock
sw: Ukuta saa

source: washing machine
sw: Mashine ya kuoshea

source: watch man
sw: Muangalizi

source: water bottle
sw: Chupa ya maji

source: water filter
sw: Chujio la Maji

source: water stand
sw: Maji ya mchanga

source: water tank
sw: tenki la maji

source: waterbottle
sw: Chupa ya maji

source: watercane
sw: Galoni la Maji

source: waterstand
sw: Egemeo la Maji

source: weight
sw: Uzito

source: weight lift
sw: Kiinua Uzito

source: well
sw: Vyema

source: wheelchair
sw: Kiti cha Matairi

source: whiteboard
sw: Ubao mweupe

source: wind mill
sw: kibaramwezi

source: wood steps
sw: Ngazi za mbao

source: wooden shelf
sw: kabati la Mbao

source: wooden torch
sw: Kurunzi ya mbao

source: woodsteps
sw: Ngazi za mbao

source: worker
sw: Mfanyakazi

source: Drag the alphabet and put it on the correct alphabet.
sw: Chukua herufi na uweke kwenye herufi sahihi

source: Choose the correct alphabet below to give power to the alphabet monster. If you choose correctly, your monster will get more power and defeat the opposite monster
sw: Chagua herufi sahihi chini, kumpa nguvu herufi Mnyama, Mnyama wako atapata nguvu sana na kumpiga mnyama mpinzani.

source: Shoot the bubble and match the correct letter.
sw: Piga povu na linganisha herufi sahihi

source: Shoot the bubble and match the correct number.
sw: Piga povu na linganisha namba sahihi

source: Bengaluru
sw: Mwanza

source: Los Angeles
sw: Zanzibar

source: Houston
sw: Arusha

source: London
sw: Dodoma

source: 3 star
sw: nyota tatu

source: 3 3 star in a row
sw: utatu nyota tatu

source: 5 3 star in a row
sw: nyota tatu bora

source: wise owl
sw: bundi mwenye busara

source: You have to help others and become a hero! Your goal is to help the farmer find his shovel.
sw: Unatakiwa usaidie wengine na kuwa shujaa! Lengo lako ni kumsaidia mkulima kutafuta Koleo lake!

source: You have to help others and become a hero! Your goal is to help the camp director get a red purse for the party.
sw: Unatakiwa usaidie wengine na kuwa shujaa! Lengo lako ni kumsaidia Kiongozi wa kambi kupata mfuko wa fedha mwekundu kwaajili ya sherehe

source: You have to help others and become a hero! Your goal is to help the miner find a flashlight.
sw: Unatakiwa kusaidia wengine na kuwa shujaa!. Lengo lako ni kumsaidia mchimbua madini mwangaza.

source: You have to help others and become a hero! Your goal is to help the girl by giving her money to reach home.
sw: Unatakiwa kusaidia wengine na kuwa shujaa! Lengo lako ni kumsaidia Msichana kwa kumpa fedha afike nyumbani.

source: You have to help others and become a hero! Your goal is to help the mother by getting her baby milk.
sw: Unatakiwa kusaidia wengine na kuwa shujaa! Lengo lako ni kumsaidia mama kwa kumletea maziwa ya mtoto.

source: You have to help others and become a hero! Your goal is to help the villager get medicine.
sw: Unatakiwa kusaidia wengine na kuwa shujaa! Lengo lako ni kumsaidia mkulima kupata dawa.

source: You have to help others and become a hero! Your goal is to help the sailor get the earth globe.
sw: Unatakiwa kusaidia wengine na kuwa shujaa! Lengo lako ni kumsaidia Baharia kupata ramani ya dunia.

source: You have to help others and become a hero! Your goal is to help the scientist go to his conference by giving him a plane ticket.
sw: Unatakiwa kusaidia wengine na kuwa shujaa! Lengo lako ni kumsaidia mwanasayansi kwenda kwenye mkutano wake kwa kumpatia tiketi ya ndege.

source: Camp
sw: Kambi

source: Mining Town
sw: Merelani

source: Farm House
sw: Nyumba ya kilimo

source: Milk Factory
sw: Kiwanda cha maziwa

source: PQR
sw: PRS

source: STU
sw: TUV

source: VWX
sw: WYZ

source: YZ
sw: A-Z

source: pqr
sw: prs

source: stu
sw: tuv

source: vwx
sw: wyz

source: yz
sw: a-z

source: Match the opposites words to form a pair.
sw: Linganisha vinyume vya maneno kuunda jozi

source: Match the same meaning words to form a pair.
sw: Linganisha maneno yanayofanana kuunda jozi

source: Match the same sounding words to form a pair.
sw: Linganisha maneno yenye sauti sawa kuunda jozi.

source: Welcome to Chimple!
sw: Karibu Chimple!

source: Welcome to the book library. You can click on any book to read it.
sw: Karibu Maktaba ya Vitabu

source: palmtree
sw: mtende

source: palmtreefruit
sw: matunda mtende

source: city
sw: mji

source: question mark
sw: alama ya swali

source: cheetah
sw: duma

source: chimpanzee
sw: sokwe

source: chimp
sw: sokwe

source: Alpha Arrange
sw: Vitalu
