Repository: Crasader/GLEXP-Team-Chimple-goa
Catalog: goa/Resources/res/lang/swa/swa.po
Languages: sw

source: I have to go for the victory march. But I don't have a crown to wear
sw: Yanipasa niende kwenye mtanange wa ushindi. Lakini sina taji la kuvaa

source: I want a whistle to signal to my friends. If you get one I will give you the balloons
sw: Ninataka kupiga mluzi kuwapa ishara marafiki zangu. Kama ukipata moja ntakupatia Mapulizo

source: It is a hot day! Come and get your ice creams
sw: Leo ni Joto sana. Njoo uchukue aisikrimu

source: Loud whistle! You can take the balloons
sw: Piga mluzi kwa nguvu! Unaweza ukachukua mapulizo

source: Now, Pick up the Sugar
sw: Sasa, Chukua Sukari.

source: Pick up Boxing Gloves
sw: Chukua kinga za vidole za Masumbwi

source: Pick up Cookie
sw: Chukua kuki

source: Pick up flashlight
sw: Chukua mwangaza

source: Pick up HeadPhones!!!
sw: Chukua spika za masikioni

source: Pick up Lantern!!!
sw: Chukua taa

source: Pick up Shoes
sw: Chukua viatu

source: Pick up the balloons
sw: Chukua Mapulizo

source: Pick up the bottle
sw: Chukua Chupa

source: Pick up the brush
sw: Chukua brashi

source: Pick up the drink
sw: Chukua kinywaji

source: Pick up the earth globe
sw: Chukua ramani ya dunia

source: Pick up the helmet from Supply Room!!!
sw: Chukua kofia kutoka nyumba ya mgawanyo

source: Pick up the ice cream
sw: Chukua aisikrimu

source: Pick up the pencil
sw: Chukua Penseli

source: Pick up the Petrol can
sw: Chukua Galoni la petrol

source: Pick up the plate!!!
sw: Chukua sahani!!!

source: Pick up the ticket
sw: Chukua tiket

source: Pick up Towel
sw: Chukua taulo

source: Pick Up Walkie Talkie
sw: Chukua mazungumzo

source: Pick up Whistle!!!
sw: Chukua mluzi

source: Pick up Wire
sw: Chukua waya

source: Switch on the red button
sw: Bonyeza kwenye batani nyekundu

source: Thanks for Boxing gloves. You can take Plates now!!
sw: Akhsante kwa Kinga za vidole za Masumbwi. Unaweza ukachukua sahani sasa!!

source: That's a clean plate. You can take my pencil
sw: Hiyo ni sahani safi. Unaweza ukachukua penseli yangu.

source: That's a juicy tomato. You can take a newspaper
sw: Hiyo ni juisi ya nyanya. Unaweza ukachukua gazeti langu.

source: That's a speedy computer. You can take the milk
sw: Hiyo ni kopyuta ya haraka. Unaweza ukachukua maziwa yangu..

source: The gym looks very plain. Can you get some balloons to decorate it?
sw: Sehemu ya mazoezi inaonekana haina kitu. Unaweza ukaleta mapulizo ya kuipambia?

source: You seem to be having a great time
sw: Unaonekana kuwa na wakati mzuri

source: camera
sw: kamera

source: gloves
sw: kinga za vidole

source: green dress
sw: Vazi ya kijani

source: purse
sw: mfuko wa fedha

source: lantern
sw: taa

source: saw
sw: msumeno

source: milk bottle
sw: chupa ya maziwa

source: flower vase
sw: chungu cha maua

source: shovel
sw: koleo

source: headphone
sw: spika za masikioni

source: post
sw: Ujumbe

source: extinguisher
sw: Kizima

source: mike
sw: kipaza sauti

source: medical box
sw: sanduku la dawa

source: note
sw: Kumbuka

source: helmet
sw: kofia

source: wire
sw: waya

source: brush
sw: brashi

source: petrol can
sw: Galoni la petroli

source: shoes
sw: viatu

source: cookies
sw: kuki

source: flashlight
sw: Mwangaza

source: Towel
sw: kitambaa

source: tomato
sw: nyanya

source: coffee maker
sw: kitengeneza kahawa

source: clock
sw: saa

source: computer
sw: kompyuta

source: walkie talkie
sw: Mazungumzo

source: combs
sw: Vitana

source: weighing machine
sw: mashine ya uzito

source: medicine
sw: dawa

source: cream
sw: krimu

source: poster
sw: bango

source: police shield
sw: ngao ya polisi

source: choose Character
sw: Chagua tabia

source: Boy
sw: Mvulana

source: Girl
sw: Msichana

source: loud speaker
sw: Spika ya sauti kubwa

source: crown
sw: taji

source: trophy
sw: Kombe

source: earth globe
sw: Ramani ya dunia

source: whistle
sw: filimbi

source: balloons
sw: puto

source: weights
sw: uzito

source: suitcase
sw: sanduku la suti

source: icecream
sw: Aiskrimu

source: drink
sw: Kinywaji

source: ticket
sw: tiketi

source: cool cap
sw: baridi kofia

source: curly mustache
sw: nzuri masharubu

source: dary tophat
sw: kofia

source: color brush
sw: rangi brashi

source: shining crown
sw: taji linalongaa

source: cute decomon
sw: paka

source: butterfly net
sw: wavu wa kipepeo

source: speed runner
sw: mwanariadha wa kasi

source: cracked egg
sw: yai lilopasuka

source: shiny goggles
sw: miwani inayongaa

source: friendly monster
sw: rafiki wa ajabu

source: flaming hero
sw: shujaa shupavu

source: super s
sw: s nzuri

source: charming face
sw: haiba uso

source: tasty pineapple
sw: nanasi tamu

source: juicy strawberry
sw: Juisi ya matunda

source: delicious cherry
sw: cheri tamu

source: tasty mango
sw: maembe matamu

source: amazing book
sw: kitabu cha ajabu

source: quacky base
sw: sarafu

source: cute monster
sw: jini zuri

source: blazing wheels
sw: matahiri ya moto

source: lightning bolt
sw: nati ya mwanga

source: candy mountain
sw: pipi ya mlima

source: fun in the sand
sw: furaha katika mchanga

source: golden carrot
sw: karoti ya dhahabu

source: scary scarecrow
sw: kikaragosi cha kutisha

source: patterned shell
sw: ganda la bahari

source: paddling shovel
sw: kupiga makasia

source: candy flake
sw: kipande cha pipi

source: impervious bridge
sw: huweza kuingia daraja

source: knockout punch
sw: ngumi ya mtoano

source: sneaky charcater
sw: muhusika mjanja

source: splashy water
sw: kumwaga maji

source: gingerbread house
sw: nyumba ya mkate wa hiliki

source: game house
sw: nyumba ya mchezo

source: blasting cannon
sw: fataki linalopasuka

source: falling asteroid
sw: kuanguka kwa jiwe

source: burning flame
sw: moto unaochoma

source: tender leaf
sw: jani la zabuni

source: fiery cannonblaster
sw: fataki la moto

source: cannon bolt
sw: nati za fataki

source: bubble gun
sw: bunduki ya povu

source: yummy mushroom
sw: uyoga

source: bubbley soap
sw: sabuni ya povu

source: funky bubble
sw: povu la ajabu

source: bubbling foam
sw: mapovu mengi

source: bubble wand
sw: fimbo ya povu

source: boxing gloves
sw: glovi za ngumi

source: shattered base
sw: meza iliyovunjika

source: mighty hammer
sw: nyundo ya nguvu

source: monolith stone
sw: jiwe kubwa

source: strolling cart
sw: gari la kubebea watoto

source: sweet chisel
sw: patasi nzuri

source: cute dino
sw: dino mzuri

source: old gem
sw: gemi ya zamani

source: choco saur
sw: choco chachu

source: bouncy castle
sw: ngome ya kuchezea

source: kaboom cannon
sw: fataki la kulipuka

source: great wall
sw: Ukuta mkubwa

source: exploding brick
sw: matofali yaliyogawanyika

source: Tough brick
sw: matofali magumu

source: sugar concrete
sw: sukari ya zege

source: roaring lion
sw: simba angurumaye

source: super kick
sw: teke hodari

source: kungfu punch
sw: ngumi ya karate

source: abundant bamboo
sw: mianzi ya kupigania

source: amazing nun chucks
sw: fimbo ya kupigania

source: flowing star
sw: nyota inayopaa

source: race car
sw: gari ya kukimbizana

source: hot wheel
sw: gurudumu la moto

source: sweet house
sw: nyumba nzuri

source: green grass
sw: majani ya kijani

source: rotating spanner
sw: spana

source: fuel syrup
sw: bomba ya mafuta

source: golden boot
sw: kiatu cha dhahabu

source: gift box
sw: sanduku la zawadi

source: Treasure box
sw: sanduku la dhamani

source: golden coin
sw: sarafu ya dhahabu

source: sea flower
sw: maua ya baharini

source: exotic ruby
sw: rubi nyekundu

source: sugar pearl
sw: sukari ya lulu

source: atom bomb
sw: chembe za bomu

source: booming switch
sw: swichi ya kulipulia bomu

source: killer blast
sw: muuaji wa kulipua

source: booming sound
sw: sauti ya kulipua

source: cracking cracker
sw: kulipua fataki

source: candycane dynamite
sw: pipi ya bomu

source: snorting pig
sw: mkoromo wa nguruwe

source: mystery box
sw: sanduku la siri

source: sleepy sheep
sw: kondoo aliyelala

source: utility rope
sw: kamba

source: mooing cow
sw: ng'ombe analia

source: candy crate
sw: pipi

source: emergency fuel
sw: mafuta ya dharura

source: steady steering
sw: uendeshaji wa pole pole

source: long road
sw: barabara ndefu

source: precious oil
sw: mafuta ya thamani

source: riding car
sw: wanaoendesha gari

source: minty wheels
sw: magurudumu

source: blooming flower
sw: maua

source: smoking pot
sw: kuvuta sigara

source: fresh sunflower
sw: alizeti safi

source: pink flower
sw: maua ya pinki

source: growing leaves
sw: majani yanayoongezaka

source: cocoa beans
sw: maharagwe ya kakao

source: tall tree
sw: mti mrefu

source: banana dip
sw: kuzamisha ndizi

source: standing flamingo
sw: Flamingo aliyesimama

source: huge elephant
sw: tembo mkubwa

source: floating feather
sw: manyoya yanayoelea

source: naughty monkey
sw: tumbili mbya

source: noise maker
sw: piga kelele

source: crazy monkey
sw: tumbili kichaa

source: drum stick
sw: fimbo za ngoma

source: music jhunjhun
sw: muziki jhunjhun

source: musical notes
sw: maelezo ya muziki

source: noisy cymbal
sw: kelele zivumazo

source: limber cat
sw: paka hodari

source: lenghty yarn
sw: uzi mrefu

source: tiny paw
sw: nyayo vidogo

source: glossy light
sw: mwanga wakungaa

source: zooming rollerskates
sw: skati

source: chocolate block
sw: kuzuia chokleti

source: yummy icecream
sw: barafu tamu

source: broken branch
sw: tawi ambalo limevunjika

source: sweet cupcake
sw: keki tamu

source: yummy lollipop
sw: lolipopu tamu

source: slinging slingshot
sw: kuliweka kombeo

source: swirly shots
sw: pipi za mduara

source: wise owl
sw: bundi mwenye busara

source: lucky leave
sw: jani la bahati

source: furry bird
sw: ndege aliyefunikwa

source: pink jellyfish
sw: pweza wa pinki

source: underwater coral
sw: mabakia ya vitu ndani ya maji

source: creamy stand
sw: kusimama creamy

source: fancy Box
sw: dhana boksi

source: heavy crate
sw: kibakuli kizito

source: milk container
sw: chombo cha maziwa

source: priceless peral
sw: lulu isiyonadhamani

source: running conveyor
sw: mkanda wa kuzunguka

source: priceless shell
sw: ganda ambalo halina faida

source: glimmering fish
sw: samaki

source: jungly lion
sw: simba wa jangwani

source: clean plate
sw: sahani safi

source: bushy plant
sw: kupanda

source: empty basket
sw: kikapu tupu

source: sweet meat
sw: nyama tamu

source: candy tree
sw: pipi mti

source: tower toy
sw: mnara feki

source: crafty cart
sw: gari la kutengeneza

source: candy cane
sw: pipi ya miwa

source: filled paintbucket
sw: ndoo ya rangi iliyojazwa

source: creamy cake
sw: keki

source: fluffy cloud
sw: wingu ambalo limefunga

source: jumping otter
sw: kuruka mtego

source: floating land
sw: ardhi iliyojuu

source: progressive flag
sw: maendeleo ya bendera

source: hot gingerbreadman
sw: mkate wa tangawizi wa moto

source: furtune wheel
sw: gurudumu

source: curious giraffe
sw: twiga mkorofi

source: healthy cauliflower
sw: kabichi lenye afya

source: crakalaking chimp
sw: gorila

source: funky elephant
sw: tembo mzuri

source: ripe watermelon
sw: tikitiki maji mbivu

source: popping balloon
sw: puto yanayojitokeza

source: leaf bomb
sw: bomu la jani

source: droping ball
sw: mpira ulioanguka

source: cute bow
sw: upinde mzuri

source: ball of leaves
sw: mpira wa majani

source: happiness box
sw: sanduku la furaha

source: express train
sw: kutoa mafunzo

source: melodious whistle
sw: filimbi za vionjo

source: go signal
sw: kwenda kwenye ishara

source: high hill
sw: kilima kirefu

source: endless traintrack
sw: kuwafuatilia tren

source: marsmallow cave
sw: pipi nyepesi

source: chocolava mountain
sw: mlima chocolava

source: joy ride
sw: furaha ya safari

source: white cloud
sw: wingu jeupe

source: fast fan
sw: shabiki wa haraka

source: eagles helmet
sw: kofia ya tai

source: flying aeroplane
sw: kuruka kwa ndege

source: mama hen
sw: mama kuku

source: stripey zebra
sw: pundamilia

source: shiny egg
sw: yai ambalo linangaa

source: little nest
sw: kiota kidogo

source: open window
sw: dirisha wazi

source: toffee tree
sw: mti wa kahawa

source: falling stone
sw: kuanguka kwa jiwe

source: squidy squid
sw: pweza

source: sweet cake
sw: keki tamu

source: gold fish
sw: samaki wa dhahabu

source: grizzly stonehand
sw: kinga za mikono

source: sweet fudge
sw: keki tamu

source: climbing ladder
sw: kupanda ngazi

source: windy windmill
sw: kipima upepo

source: dry hay
sw: nyasi kavu

source: funny starfish
sw: samaki wa nyota

source: yummy candystick
sw: pipi kijiti tamu

source: cupy cake
sw: keki za kikombe

source: life saver
sw: mwokoaji wa maisha

source: launching rocket
sw: uzinduzi wa roketi

source: shocking shock
sw: mshtuko wakushangaza

source: pink candy
sw: pipi ya pinki

source: strong safe
sw: nguvu salama

source: cotton candy
sw: pipi ya pamba

source: jumping jack
sw: kuruka jeki

source: tidy shoe
sw: kiatu sahihi

source: jumping frog
sw: chura anayeruka

source: flying mountain
sw: kuruka mlima

source: cotton wings
sw: mabawa ya pamba

source: dark hat
sw: kofia nyeusi

source: gem balloon
sw: puto la thamani

source: strawberry cake
sw: keki ya tunda

source: musical harp
sw: muziki wa kinubi

source: arranging blocks
sw: kupanga vitalu

source: large bowl
sw: bakuli kubwa

source: elite book
sw: wasomi wa kitabu

source: minty notes
sw: maelezo minti

source: glass star
sw: nyota ya kioo

source: gold plus
sw: dhahabu pamoja

source: blue pyramid
sw: bluu piramidi

source: pink hexagon
sw: pembesita ya pinki

source: red circle
sw: mduara mwekundu

source: square delight
sw: mraba sahihi

source: number one
sw: namba moja

source: tri cookie
sw: biskuti tatu

source: fantastic four
sw: nne ya kuvutia

source: number six
sw: namba sita

source: lifesaver tube
sw: mpira wa huokoaji wa maishi

source: wide umbrella
sw: mwavuli mpana

source: sunny beachball
sw: mpira unaongaaa

source: shiny shell
sw: sehemu inayongaa

source: mighty tractor
sw: trekta la nguvu

source: goldy goat
sw: mbuzi wa dhahabu

source: wind mill
sw: upepo wa kinu

source: old house
sw: nyumba ya zamani

source: big barn
sw: ghala kubwa

source: cute pig
sw: nguruwe mzuri

source: green tree
sw: mti wa kijani

source: tiny dragonfly
sw: dragoni wadogo anaopaa

source: water splash
sw: mwaga maji

source: fresh fish
sw: samaki msafi

source: smiling frog
sw: chura wa kutabasamu

source: sweet rod
sw: fimbo tamu

source: blasting dot
sw: ulipuaji wa nukta

source: playful domino
sw: mchezo wa dice

source: rolling dice
sw: kete inayozunguka

source: candy treats
sw: zawadi ya pipi

source: cream jug
sw: jagi la krimu

source: sharp drop
sw: kushuka kwa kasi

source: milky cow
sw: ng'ombe wa maziwa

source: metallic gear
sw: gia ya chuma

source: loaded container
sw: chombo cha kubeba

source: chocolate bar
sw: mnara wa chokleti

source: climbing step
sw: kupanda kwa hatua

source: slippery steps
sw: hatua zinazoteleza

source: green gem
sw: kijani cha dhamani

source: creamy donut
sw: donati lenyeutamu

source: flying fluffy
sw: kuruka kwa kuhiwa

source: cute rabbit
sw: sungura mzuri

source: baked cookie
sw: biskuti zilizopikwa

source: grass patch
sw: kiraka cha nyasi

source: sharp scissors
sw: mkasi mkali

source: floating lotus
sw: maua yanayoelea

source: minty stones
sw: mawe ya minti

source: peppermint candy
sw: pipi ya peremende

source: juicy lollipop
sw: Juisi ya lolipopu

source: chocolate toffee
sw: utamu wa chokleti

source: heart gem
sw: moyo wa dhamani

source: sticky jellybean
sw: pweza anayenata

source: sugar tag
sw: lebo ya sukari

source: candy balloon
sw: pipi ya puto

source: gaint balloon
sw: puto kubwa

source: balloon pump
sw: pampu ya puto

source: shinny balloontoy
sw: puto ambalo linangaa

source: floating balloon
sw: puto yanayoelea

source: blasting ballon
sw: ulipuaji wa puto

source: shopping bag
sw: mfuko wa ununuzi

source: fresh brinjal
sw: Brinjal safi

source: poping corn
sw: kuchoma mahindi

source: raw carrot
sw: karoti mbichi

source: chocolate coins
sw: sarafu ya chokleti

source: tasty pizza
sw: pizza tamu

source: pizza box
sw: sanduku la piza

source: yummy slice
sw: kipande kitamu

source: pizza topping
sw: laya ya piza

source: pouring saltnpepper
sw: chumvi

source: creamy slushy
sw: juisi ya vikopo

source: money machine
sw: mashine ya fedha

source: dazzled purse
sw: mfuko wa fedha wadhamani

source: cash receipt
sw: kupokea fedha

source: thin card
sw: kadi nyembamba

source: stacked currency
sw: sifa ya fedha

source: dollar cane
sw: miwa ya dola

source: happy cow
sw: ng'ombe wa furaha

source: hot dog
sw: mbwa mkali

source: chubby pig
sw: nguruwe mwenye mvuto

source: roast chicken
sw: kuku choma

source: gleeful sheep
sw: kondoo mwenye furaha

source: sweet cards
sw: kadi nzuri

source: ocean fish
sw: samaki wa baharini

source: shallow anchor
sw: kina nanga

source: water plant
sw: utengenezaji wa maji

source: jelly fish
sw: samaki wa pweza

source: drowning scubaglass
sw: maksi za kuogelea

source: addition
sw: Kujumlisha keki moja, keki moja, moja na moja pamoja zinakuwa mbili pipi tano, pipi tatu, tano jumlisha tatu ni nane

source: addition_carryover_1
sw: Kujumlisha kipengele cha kwanza sitini na mbili jumlisha thelathini na moja ,kuanza tunajumlisha mamoja, mbili jumlisha moja ambayo ni sawa sawa na tatu, alafu makumi, sita jumlisha tatu ambayo ni tisa, tisini na tatu

source: addition_carryover_2
sw: Kujumlisha kipengele cha pili Ishirini na nne jumlisha kumi na nane , kwanza tunaanza kujumlisha mamoja, nne jumlisha nane ni sawa sawa na kumi na mbili,nenda na moja kichwani kwenye namba inayofuata, ukiacha mbili , jumlisha mbili jumlisha moja jumlisha moja kutokea kule ulipoiweka kichwani ambayo ni nne ,arubaini na mbili

source: addition_carryover_3
sw: Kujumlisha kipengele cha tatu Thelathini na mbili jumlisha ishirini na tano ,kwanza tuna jumlisha mamoja, saba jumlisha tano ni sawa sawa na kumi na mbili ,chukua moja nenda kwenye namba inayofuata, umebakiwa na mbili, jumlisha tatu jumlisha moja kutokea kule ulipoichukua ambayo itakuwa ni sawas sawa na sita ,sitini na mbili

source: adjective
sw: Kiwakilishi Viwakilishi vinaelezea ubora, ukubwa, na namba za majina au viwakilishi.

source: adverb
sw: Vielezi Vielezi vinaeleza vitendo, matendo, au kielezi kingine. Alipelekwa chini haraka.

source: alphabet
sw: Herufi

source: antonym
sw: Kinyume cha maneno Kinyume cha maneno kwenye neno moja kwenda jingine na ya kaleta maana tofauti. Furaha, Kusikitisha ,Kushoto ,Kulia, Chini ,Juu ,Kubwa ,Ndogo

source: article
sw: Vitenzi Vitenzi ni maneno ambayo yanatumika kabla ya majina kama vile A na KWENYE.

source: conjunction
sw: Viunganishi Viunganishi ni maneno yanayounganisha maneno na kifungu cha habari.

source: day
sw: Siku Kuna siku saba ndani ya wiki. Ambazo ni Jumapili, Jumatatu ,Jumanne, Jumatano, Alhamisi, Ijumaa, Jumamosi

source: even_odd
sw: Namba witiri Namba witiri ni namba ambazo haziwezi kugawanyika kwa pamoja na kubaki. Moja, namba shufwa zinaweza kugawanyika kwa mbili bila kubaki. Mbili. Tatu. Nne. Tano. Sita. Saba. Nane. Tisa

source: homonym
sw: Maneno mawili au moja ambayo yanatamkwa kama neno lingine ila lina maana tofauti na neno lenyewe

source: interjection
sw: Kihisishi Kihisishi n maneno yanayosababisha mshituko wa ghafla na kukuachia mshangao . vizuri!!!sahivi tunefanya vyema

source: month
sw: Mwezi Kuna miezi 12 ndani ya mwaka. Januari. Februari. Machi.Aprili,Mei, Juni, Julai, Agosti ,septemba, Octoba, Novemba, Desemba

source: multiplication
sw: Kuzidisha Kuzidisha ni kurudia kujumlisha. 5 zidisha kwa 2. Angalia wingi wa mipira 5. Chukua mipara miwili kati ya mitano.ijumlishe mpaka upate10. 6 zidisha kwa 2. Angalia wingi wa mipira 6. Chukua mipira miwili. Ijumlishe mpaka upate 12. 5 zidisha kwa 3. Angalia ndoo 5 za keki. Chukua 3 kati yao. Jumlisha mpaka upate 15. 6 zidisha kwa 3. Angalia ndoo ya 6 keki. Chukua 3 kati yao. Jumlisha mpaka upate 18

source: noun
sw: Jina au Nomino Nomino inatumika kutaja jina la mtu, vitu, mnyama au mahali. Jua lina waka

source: number
sw: Namba Hesabu pamoja vidole vyako. Moja, Mbili, Tatu, Nne, Tano, Sita, Saba, Nane, Tisa, Kumi

source: plural
sw: Wingi Umoja inamaanisha moja ambapo ,Wingi inamaanisha vitu zaidi ya kimoja. Paka,Paka. Basi,Mabasi. Mwanamke, Wanawake. Kisu, Visu. Jino, Meno

source: pos
sw: Maneno yamegawanywa katika aina tofauti za hotuba. Nomino au Majina. Jua lina waka. Kiwakilishi. Yeye anataka kula. Kielezi

source: preposition
sw: Vielezi Vielezi vinatumika kuonyesha mda au kuelezea mahali Nina penda kusoma

source: pronoun
sw: Viwakilishi

source: subtraction
sw: Kutoa

source: subtraction_carryover_1
sw: Kutoa

source: subtraction_carryover_2
sw: Kutoa

source: subtraction_carryover_3
sw: Kutoa

source: synonym
sw: Kisawe

source: table10
sw: Hii ni orodha ya kuzidisha ya 10

source: table2
sw: Hii ni orodha ya kuzidisha ya 2

source: table3
sw: Hii ni orodha ya kuzidisha ya 3

source: table4
sw: Hii ni orodha ya kuzidisha ya 4

source: table5
sw: Hii ni orodha ya kuzidisha ya 5

source: table6
sw: Hii ni orodha ya kuzidisha ya 6

source: table7
sw: Hii ni orodha ya kuzidisha ya 7

source: table8
sw: Hii ni orodha ya kuzidisha ya 8

source: table9
sw: Hii ni orodha ya kuzidisha ya 9

source: verb
sw: Vitenzi

source: word
sw: Maneno

source: actor
sw: Muigizaji

source: air conditioner
sw: Kiyoyozi

source: airport
sw: Kiwanja cha ndege

source: airport door
sw: mlango wa Kiwanja cha ndege

source: airport upper
sw: Juu ya kiwanja cha ndege

source: almirah
sw: Kabati

source: animal
sw: Mnyama

source: atm machine
sw: Mashine ya fedha

source: avacado
sw: Parachichi

source: axe
sw: Jembe

source: axe
sw: Jembe

source: baby mother
sw: Mtoto mama

source: background
sw: historia ya nyuma

source: bank mainground
sw: Uwanja mkuu wa benki

source: bar
sw: Kipande

source: barista
sw: Muhudumu

source: barnhouse
sw: Ghala

source: barrel
sw: pipa

source: base upper
sw: Msingi kwa juu

source: baseball
sw: besiboli

source: basket man
sw: mtu wa kikapu

source: basketball
sw: Mpira wa kikapu

source: bat
sw: popo

source: bath tub
sw: Beseni la kuogea

source: bathroom floor
sw: Sakafu ya bafu

source: bathroomwall
sw: ukuta wa bafu

source: baton
sw: piga

source: beautician
sw: mrembaji

source: beauty parlour
sw: mrembaji

source: beauty parlour door
sw: mlango

source: bell
sw: kengele

source: big spade
sw: panga kubwa

source: bin
sw: pipa

source: book blue
sw: kitabu bluu

source: book brown
sw: kitabu kahawia

source: book desk
sw: kitabu dawati

source: book green
sw: kitabu kijani

source: book grey
sw: kitabu kijivu

source: book orange
sw: kitabu chungwa

source: book purple
sw: kitabu zambarau

source: book shell
sw: kitabu ganda

source: book stand
sw: Egemea la kitabu

source: bookstand
sw: Egemeo la kitabu

source: bottles
sw: Chupa

source: box back
sw: Boksi nyuma

source: box back
sw: Boksi nyuma

source: box front
sw: Boksi mbele

source: boxing bag
sw: Masumbwi mfuko

source: boxing punch
sw: Ndondi ngumi

source: bridge
sw: daraja

source: broccoli
sw: kabichi

source: broken stairs
sw: Ngazi mbovu

source: bus stop
sw: Kituo cha basi

source: cafe
sw: Mgahawa

source: cafedoor
sw: Mlango wa Mgahawa

source: cafeowner
sw: Mmiliki wa Mgahawa

source: calender
sw: Kalenda

source: calf machines
sw: Mashine ya mazoezi

source: can
sw: galoni

source: can
sw: galoni

source: capsicum
sw: hoho

source: cardio machine
sw: mashine ya kukimbia

source: cart
sw: lori

source: cartback
sw: lori nyuma

source: cartonbox
sw: boksi

source: cash register
sw: fesha kusajili

source: cashier
sw: Muhudumu wa benki

source: cashier counter
sw: Kaunta ya muhudumu wa benki

source: cell
sw: seli

source: certificate
sw: cheti

source: chairs
sw: kiti

source: chef
sw: mpishi

source: cherries
sw: tunda

source: chilli
sw: pilipili

source: chimney
sw: bomba la moshi

source: chopping board
sw: kibao cha kukatia

source: clothshop door
sw: mlango wa duka la nguo

source: club
sw: klabu

source: club door
sw: mlango wa klabu
