Repository: Crasader/GLEXP-Team-Chimple-goa
Catalog: goa/Resources/res/lang/swa/swa.po
Languages: sw

source: sandcastle
sw: ngome mchanga

source: school
sw: shule

source: seabed
sw: ufukwe

source: seeds
sw: mbegu

source: shape
sw: sura

source: shark
sw: papa

source: sheep
sw: kondoo

source: sheet
sw: karatasi

source: shelf
sw: rafu

source: ship
sw: meli

source: shirt
sw: shati

source: shoe
sw: kiatu

source: shop
sw: duka

source: skirt
sw: sketi

source: sky
sw: anga

source: snake
sw: nyoka

source: snow
sw: theluji

source: soap
sw: sabuni

source: soil
sw: udongo

source: spider
sw: buibui

source: spinach
sw: mchicha

source: splash
sw: splashi

source: squirrel
sw: chindi

source: stall
sw: duka

source: star
sw: nyota

source: stars
sw: nyota

source: stick
sw: fimbo

source: stone
sw: jiwe

source: stool
sw: kinyesi

source: stove
sw: jiko

source: street light
sw: mwanga mitaani

source: sugar
sw: sukari

source: sun
sw: jua

source: sun
sw: jua

source: sunflower
sw: alizeti

source: table
sw: meza

source: tap
sw: bomba

source: teacher
sw: mwalimu

source: tent
sw: hema

source: tornado
sw: kimbunga

source: tortoise
sw: kobe

source: tow truck
sw: tow lori

source: towel
sw: kitambaa

source: track
sw: kufuatilia

source: tractor
sw: trekta

source: train
sw: treni

source: trap
sw: mtego

source: treasurebox
sw: hazina

source: truck
sw: lori

source: turtle
sw: kobe

source: tv
sw: filamu

source: umbrella
sw: mwavuli

source: uniform
sw: sare

source: van
sw: gari

source: vase
sw: chombo hicho

source: vessel
sw: chombo

source: wall
sw: ukuta

source: wallplate
sw: sahani ukuta

source: wash
sw: safisha

source: wash basin
sw: bonde la safisha

source: watch
sw: kuangalia

source: water
sw: maji

source: water pot
sw: sufuria ya maji

source: water trough
sw: kupitia nyimbo maji

source: watermelon
sw: tikiti maji

source: watersplash
sw: mlio wa maji

source: wave
sw: wimbi

source: waves
sw: mawimbi

source: wax
sw: nta

source: wicket
sw: mlango mdogo

source: wind
sw: upepo

source: window
sw: dirisha

source: woman
sw: mwanamke

source: women
sw: wanawake

source: wood
sw: kuni

source: zebra
sw: pundamilia

source: zebra crossing
sw: pundamilia kuvuka

source: choose same sounding word :
sw: chagua neno sawa na mlio :

source: List of Homonyms
sw: maneno yanayofanana yenye maana tofauti

source: choose meaning word of :
sw: chagua maana ya neno :

source: List of Synonyms
sw: horodha ya maneno yanayofanana

source: choose opposite word of :
sw: chagua kinyume cha maneno :

source: List of Antonyms
sw: horodha ya kichume cha maneno

source: List of words
sw: horodha ya maneno

source: Make word of same meaning as :
sw: Tengeneza neno lenye maana sawa :

source: List of same meaning words
sw: Horodha ya maneno yanayofanana

source: Make opposite of :
sw: Tengeneza kinyume cha :

source: List of opposite words
sw: Horodha ya vinyume vya maneno

source: Make same sounding word as :
sw: Tengeneza sauti ya neno linalofanana na :

source: List of same sounding words
sw: Horodhesha sauti ya neno linalofanana na :

source: Make same word :
sw: Tengeneza neno linalofanana :

source: List of same words
sw: Horodhesha neno linalofanana

source: Make plural of :
sw: Tengheneza wingi wa :

source: List of singular-plural words
sw: Tengeneza umoja wa

source: Identify the NOUN
sw: Tambua Nomino

source: Identify the VERB
sw: Tambua Kitenzi

source: Identify the ADJECTIVE
sw: Tambua vielezi

source: List of Nouns
sw: Horodha ya Nomino

source: List of Verbs
sw: Horodha ya Vitenzi

source: List of Adjectives
sw: Horodha ya Vielezi

source: Select Verb
sw: Chagua Kitenzi

source: Select Noun
sw: Chagua Nomino

source: Select Pronoun
sw: Chagua Kiwakilishi

source: Select Adverb
sw: Chagua Kivumishi

source: Select Adjective
sw: Chagua Kielezi

source: Select Preposition
sw: Chagua kihusishi

source: Select Conjunction
sw: Chagua kiunganishi

source: Select Interjection
sw: Chagua kihisishi

source: Select Article
sw: Chagua Makala

source: How many
sw: wangapi

source: are there?
sw: wapo ?

source: one
sw: moja

source: two
sw: mbili

source: three
sw: tatu

source: four
sw: nne

source: five
sw: tano

source: six
sw: sita

source: seven
sw: saba

source: eight
sw: nane

source: nine
sw: tisa

source: ten
sw: kumi

source: Enter secret code to unlock all levels
sw: ingiza namba ya siri kufungua daraja zote

source: You have not yet earned any rewards
sw: hujapata zawadi yoyote

source: Game Unlocked
sw: Mchezo umefunguka

source: Trophy earned
sw: umekuwa mshindi

source: Write letter :
sw: Andika herufi :

source: Write number :
sw: Andika namba :

source: Write word :
sw: Andika neno :

source: Write plural of :
sw: Andika wingi ya :

source: Write opposite of :
sw: Andika kinyume cha :

source: Write word of same meaning as :
sw: Andika neno la maana hiyo hiyo na :

source: Write same sounding word as :
sw: Andika neno linalofanana na sauti ya neno :

source: diamond
sw: Alamasi

source: pentagon
sw: pembetano

source: square
sw: Mraba

source: hexagon
sw: pembesita

source: octagon
sw: pembenane

source: rectangle
sw: Mstatili

source: cross
sw: kuvuka

source: oval
sw: Mviringo

source: triangle
sw: pembe tatu

source: Hero
sw: Shujaa

source: Create A Story
sw: Tengeneza stori

source: window bar
sw: Guzo za madirisha

source: dining
sw: sehemu ya kulia chakula

source: vulture
sw: tai

source: How many are there?
sw: Wapo wangapi?

source: choose same sounding word
sw: chagua neno sawa na mlio

source: choose opposite word
sw: Chagua kinyume cha neno

source: Hits : 0
sw: piga: 0

source: Hits :
sw: piga :

source: choose meaning word
sw: chagua maana ya neon

source: Drag the alphabet and put it on the correct alphabet
sw: chukua herufi na huweke iwe kwenye herufi sahihi

source: choose same meaning word
sw: chagua maana hiyo ya neno

source: Shoot the bubble and match the correct letter or number
sw: piga pulizo na ufananishe herufi au namba iliyo sahhi

source: Drag the alphabet and drop on the dino
sw: chukua herufi na huweke kwenye mnyama

source: Milk factory
sw: Kiwanda cha maziwa

source: Hello! How are you? I am a farmer
sw: Hodi! Habari gani?. Mimi ni mkulima

source: How can I help you?
sw: Nikusaidiaje?

source: Thank you! You have helped me a lot! I can now plant my seeds and get a huge harvest!
sw: Akhsante! Umenisaidia sana! Sasa ninaweza kuotesha mbegu zangu na kupata mazao mengi!

source: I generate power from the windmill to irrigate the farm
sw: Nimezalisha umeme kutoka kwenye Kibarazamwezi kwaajili ya kumwagilia shamba

source: Oh! But the windmill is not moving
sw: Oh!, Lakini kibarazamwezi hakizunguki

source: Can you please switch on the red button to turn on the windmill?
sw: Je unaweza kubonyeza kwenye batani nyekundu kuwasha kibarazamwezi?

source: Good job! You can take my basket now. It is near the tractor
sw: Kazi Nzuri! Unaweza ukachukua kikapu changu sasa. Kipo karibu na trekta

source: Go to the windmill
sw: Nenda kwenye kibarazamwezi

source: Who goes there? I am the watchman
sw: Nani kaenda pale? Mimi ni Mlinzi

source: I like this farm
sw: Ninapenda hili Shamba

source: Ah! I can drink sweet tea now
sw: Ah! Ninaweza kunywa chai tamu sasa

source: I can't give you a mango unless the watchman agrees
sw: Siwezi kukupatia maembe mpaka mlinzi akubali

source: I am so tired working all day
sw: nimechoka sana kufanya kazi kutwa nzima

source: I can help you! What do you want?
sw: Ninaweza kukusaidia! Unataka nini

source: I wish I had a sweet mango to eat
sw: Ninatamani ningekua na maembe matamu ya kula

source: That is such a treat! You can take the saw above
sw: hiyo ni ya asili! Unaweza ukachukua Msumeno

source: Ask the worker
sw: Muulize mfanyakazi

source: It is so dull around here
sw: kuna giza sana hapa

source: This place can sure brighten up
sw: Hii sehemu inaweza kumulikwa

source: I think a flower vase would make this place nice
sw: nahisi chungu cha maua kitaifanya hii sehemu ipendeze

source: Now this place looks beautiful. You can take the shovel
sw: Sasa hili eneo limependeza. Unaweza ukachukua koleo

source: Ask the mechanic
sw: muulize fundi

source: I have so many things to store. But where to store?
sw: Ninaweza nikawa na vitu vingi vya kuhifadhi. Lakini sehemu ya kuhifadhia ipo wapi?

source: Can you get me a basket?
sw: Unaweza ukanipatia kikapu?

source: Excellent! Now I can keep all the items in this basket
sw: Vizuri sana! Sasa ninaweza kuhifadhi vitu vyote kwenye kikapu

source: Ask the store keeper
sw: muulize mtunza hifadhi

source: I want to decorate this place
sw: Unataka nini?

source: What do you need?
sw: ninataka kupamba hii sehemu

source: I always liked a good painting in a frame
sw: Siku zote hupendelea rangi nzuri usoni

source: Thank you! I will put it on the wall. You can take milk for your trouble
sw: Akhsante!Nitaiweka ukutani. Unaweza chukua maziwa kwa ajili matatizo yako

source: Ask the milk man
sw: Muulize mtu wa maziwa

source: I like to paint
sw: Ninapenda rangi

source: It is so pretty. Why are you not painting?
sw: Ni nzuri sana. Kwanini hupaki rangi?

source: I need to cut the picture frame. I wish someone got me a saw
sw: Ninataka kukata uso wa picha. Ninatamani mtu angenipa msumeno

source: That is a handy saw. I can now cut frames and put my painting in it. You can take that painting on the wall
sw: Huo ni msumeno wa mkononi. Ninaweza sasa kukata nyuso na kuzipaka rangi zangu. Unaweza kuchukua ile rangi ya ukutani

source: Ask the painter
sw: Muulize mpaka rangi

source: My cat has run away
sw: Paka wangu wamekimbia mbali

source: How can you find the cat?
sw: Unawezaje kumtafuta paka?

source: Now my cat will come back to drink milk. You can take the flower vase
sw: Sasa Paka wangu atarudi kunywa maziwa. Unaweza kuchukua chungu cha maua

source: Ask the lady
sw: Muulize Msichana

source: Thanks for turnin-on windmill!!!
sw: Akhsante kwa kuwasha kibarazamwezi

source: Already Basket in Bag!!
sw: Tiari kikapu kwenye begi

source: I have to go to a party.
sw: yanipasa niende kwenye sherehe

source: Great! I love parties.
sw: Vizuri! Ninapenda sherehe

source: But I dont have any purse that matches my dress. Can you get me a red purse?
sw: Lakini sina mfuko wa fedha unaoendana na Gauni langu. Unaweza ukanipa Mfuko wa fedha mwekundu?

source: I love camping in the outdoors.
sw: Ninapenda kambi za nje

source: It is nice and bright. But what will you do when it gets dark?
sw: Ni nzuri na ina mwanga. Lakini utafanya nini giza likiingia?

source: That is a lovely purse. I will look great at the party!
sw: Huo ni mfuko mzuri wa fedha. Nitapendeza sana kwenye sherehe

source: Hope you can see better in the dark with the lantern
sw: Natumaini unaweza kuona vyema gizani kwa kutumia taa.

source: I have to go to a boxing match.
sw: inanipasa niende kwenye mtanange wa masumbwi

source: What are you waiting for?
sw: unasubiri nini?

source: I want a pair of boxing gloves.
sw: Ninataka Jozi za kinga za vidole za masumbwi

source: I am so hungry. I have not eaten since morning.
sw: Nina njaa sana. Sijala tangu asubuh.

source: I can help you. What do you need?
sw: Ninaweza kukusaidia. Unahitaji nini?

source: Thanks for the shiny plate. I can enjoy my food now. You can take the camera.
sw: Akhsante kwa sahani ing'arayo. Ninaweza kufurahia chakula changu sasa. Unaweza ukanipiga picha.

source: I get very afraid in the dark
sw: ninaogopa san gizani

source: What will help you to be less afraid?
sw: Nini kitakusaidia usiogope sana?

source: I can see better if I had a lantern
sw: Ninaweza kuona vyema kama nikipata Taa

source: Thanks for the lantern. It will make me see better in the dark. You can take the ladder
sw: Akhsante kwa taa. Itanifanya nione vizuri gizani. Unaweza ukachukua Ngazi

source: Ask Model for Help!!!
sw: Muulize Model kwa msaada!!!

source: Ask PhotoGrapher for Help!!!
sw: Muulize mpiga Picha kwa msaada!!!

source: Already in Bag
sw: Tayari kwenye begi

source: I am the shop keeper. It is so difficult to reach for items in the top
sw: Mimi ni Mtunza Duka. Ni vigumu sana Kufikia vitu vilivyopo juu

source: Your shop had a lot of items above
sw: Duka lako lina vitu vingi juu

source: I would really like a ladder to climb on
sw: Ningependelea Ngazi kwa ajili kupandia

source: Nice looking ladder! You can take the green dress
sw: Ngazi Nzuri! Unaweza kuchukua nguo ya kijani

source: Ask Shop Keeper!!!
sw: Muulize mtunza duka

source: I like to stitch clothes. But they get dirty if I put them on the floor
sw: Napenda kushona nguo. Lakini zinachafuka nikiziweka sakafuni.

source: What do you need to keep them neat?
sw: Unahitaji nini kuwafanya wale?

source: I would like a rope to hand all the clothes
sw: Ningependelea kuzifunga nguo zote

source: Thanks for the rope. Now my clothes can be put on the rope. You can take the red purse
sw: Akhsante kwa Kamba. Sasa nguo zangu zinaweza kuwekwa kwneye kamba. Unaweza ukachulkua mfuko mwekundu wa fedha.

source: Ask Tailer!!!
sw: Muulize Muuzaji

source: I am the gym owner. I need to look nice for my conference
sw: mimi ni mmiliki wa sehemu ya Mazoezi. Nahitaji Kupendeza kwaajili ya mkutano wangu

source: I want to wear a green business suit
sw: Nina hitaji kuvaa suti ya kijani ya kibiashara

source: I have a very important match
sw: Nina Mtanange mkubwa wa muhimu sana

source: Why are you still here?
sw: Kwanini bado upo hapa?

source: I want a camera to take photos of the match
sw: Ninahitaji camera nipige picha za mtanange

source: This dress looks very smart. You can take the boxing gloves
sw: Hii nguo inaonekana nzuri sana. Unaweza ukachukua kinga za vidole za masumbwi

source: Great looking camera. You can take my skipping rope
sw: Kamera nzuri. Unaeza ukachukua kamba yangu ya kuruka

source: Ask Gym Owner!!!
sw: Muulize mmiliki wa sehemu ya mazoezi

source: Ask Soccer Player!!!
sw: Muulize mchezaji wa mpira wa miguu

source: Ask cowboy
sw: Muulize Mtunza Ng'ombe

source: Now Pick up Red Purse!!!
sw: Sasa chagua Mfuko wa fedha mwekundu

source: I am the owner of this mining supply store
sw: Mimi ni Mmiliki wa ghala hili la madini yasambazwayo

source: You have a very nice store
sw: una Ghala zuri

source: You can take a helmet if you like
sw: unaweza ukachukua kofia kama umeipenda

source: Make good use of the helmet
sw: itumie kofia vizuri

source: I go into the mines and find precious metals
sw: Nimeenda machimboni nikapata vyuma vizuri

source: That sounds exciting.
sw: Inaonekana kusisimua

source: But it gets dark in the mine. Can you get me a flashlight?
sw: Lakini kunakua giza machimboni. Unaweza ukanipatia mwanga

source: Thanks for the powerful flashlight. I will be safe in the mine
sw: Akhsante kwa Mwangaza wenye nguvu. Nitakua salama kwenye machimbo

source: I fill petrol into the cars
sw: Ninajaza petroli kwenye magari

source: It must be tiring in the hot sun.
sw: itakua imechoka kwenye jua kali

source: But it Yes I am very thirsty. Can you get me something to drink?
sw: Lakini ni kweli nina Kiu sana. Unaweza ukanipa kitu cha kunywa?

source: That is refreshing. You can take the petrol can
sw: hayo ni mahitaji. Unaweza ukachukua dumu la Petroli

source: I am the owner of this place
sw: Mimi ni mmiliki wa hili eneo

source: It looks very nice
sw: Imependeza sana

source: But the walls need to be painted. Can you get me a brush?
sw: Lakini ukuta unatakiwa upakwe rangi. Unaweza ukanipatia brashi?

source: Now I can paint the walls. You can take a cold drink for your trouble
sw: Sasa naweza kuupaka ukuta rangi. Unaweza kuchukua kinywaji baridi kwa ajili ya matatzo yako

source: I am your waiter. How may I serve you?
sw: Mimi ni Muhudumu wako. Nikuhudumie nini?

source: It must be tough to be standing all day
sw: itakua ngumu kusimama kutwa nzima

source: My feet hurt because my shoes are torn. Can you get me some shoes?
sw: Miguu yangu inauma kwasababu viatu vyangu vimechanika. Unaweza ukanipatia viatu?

source: These shoes look sturdy. You can take a cookies
sw: Hivi viatu vinaonekana Imara. Unaweza ukachukua kuki

source: I just finished driving the train
sw: Nimemaliza Kuendesha Gari moshi

source: Will you be going home now?
sw: Utaenda nyumbani sasahivi?

source: My car has no petrol. Can you get me some petrol?
sw: Gari langu halina Petroli. Unaweza ukanipatia kiasi cha Petroli?

source: Yay! I can go home with this petrol. You can take my spare shoes
sw: Yay! Ninaweza kwenda nyumbani na petroli. Unaweza ukachukua viatu vyangu vya ziada.

source: I am a painter. I like to paint walls
sw: Mimi ni Mpaka rangi. Ninapenda kupaka ukuta rangi.

source: I also like clean walls
sw: Mimi pia hupenda ukuta msafi

source: I need to tie up all my tools. Can you get me a wire?
sw: Ninataka kufunga vifaa vyangu vyote. Unaweza ukanipatia waya?

source: Now I can pack up. You can take my brush
sw: Sasa ninaweza kufungasha. Unaweza kuchukua Brashi langu

source: I have many electrical items in stock
sw: Nina vitu vingi vya umeme kwenye hisa

source: It is a fine place
sw: Ni sehemu Nzuri

source: But I dont have a helmet to be safe
sw: Lakini sina kofia niwe salama

source: This helmet will keep me safe outside. You can take some wire
sw: Hii kofia itaniweka salama kwa nje. Unaweza kuchukua baadhi ya waya

source: I am an electrician. I make sure the lights work
sw: Mimi ni fundi umeme. Ninahakikisha taa zinafanya kazi

source: It looks like hard work
sw: Inaonekana ni kazi ngumu.

source: It is fun too. But I wish I had a snack. Maybe a cookies
sw: Inafurahisha pia. Lakini natamani ningepata biskuti. Au hata kuki

source: Yummy cookies! You can take the flashlight
sw: Yummy kuki! Unaweza ukachukua mwangaza

source: Ask Electric Owner!!!
sw: Muulize mmiliki wa umeme!!!

source: Ask Electrician!!!
sw: Muulize fundi umeme!!!

source: Already in Bag!!!
sw: tayari kwenye begi!!!

source: Ask Painter!!!
sw: Muulize mpaka rangi!!!

source: Ask Cafe Owner!!!
sw: Muulize mmiliki wa café!!!

source: Ask Waiter
sw: muulize muudumu!!!

source: Ask Train Driver!!!
sw: Muulize Dereva wa Gari moshi

source: Ask Petrol Guy!!!
sw: Muulize mtu wa petroli

source: I like to mix music and play in the club
sw: Ninapenda kuchanga muziki na kucheza kwenye klabu

source: Your music is awesome
sw: Muziki wako ni mzuri sana

source: Thank you! You can take the headphones and listen to music
sw: Akhsante! Unaweza ukachukua spika za masikioni ukasikiliza muziki

source: Happy listening on the headphones
sw: Ni furaha kusikiliza kwenye spika za masikioni

source: I handle all the post in the post office
sw: Ninasimamia posta zote katika ofisi ya posta

source: It looks very efficient
sw: inaonekana kufanya kazi vizuri

source: I would like a headphone to listen to music when I work
sw: Ningependelea spika za masikio kusikilizia muziki wakati ninafanya kazi

source: Cool headphones! You can take the letter
sw: Spika za masikioni nzuri sana! Unaweza ukachukua barua

source: Ask the post clerk
sw: Muulize Karani wa Posta

source: I am a fireman. I am the enemy of fire
sw: Mimi ni mtu wa zima moto. Ni adui wa moto

source: You must have save plenty of houses from fire
sw: Utakua umeokoa nyumba nyingi kutoka kwenye moto

source: My post is waiting at the post office. Can you go get it?
sw: Posta yangu inasubiria katika ofisi za posta. Unaweza ukaenda kuchukua?

source: Ah! A letter from my mother! You can take the fire extinguisher
sw: Ah! Barua kutoka kwa mama yangu! Unaweza kuchukua Kizima Moto

source: Ask the fireman!!
sw: Muulize mtu wa Zima moto!!

source: I talk to all the customers of the bank
sw: Nimeongea na wateja wote wa benki

source: That is such a lovely job
sw: Hiyo ni kazi nzuri sana

source: But I want the bank to be safe. We don’t have a fire extinguisher in case of fire
sw: Lakini ninahitaji benki iwe salama. Hatuna vizima moto kama moto ukitokea

source: Now our bank is safe. You can take the phone
sw: Sasa benki yetu ipo salama. Unaweza ukachukua simu

source: Ask the teller!!
sw: Muulize Muhudumu wa benki

source: I sing in the club. How do you like my singing?
sw: uimbaji kwenye klabu. Umependaje uimbaji wangu?

source: It is enchanting. I feel like dancing
sw: inanivutia. Nahisi kucheza

source: I would like a phone so that my fans can call me
sw: Ningependelea simu ili marafiki zangu waweze kunipigia

source: Super phone! You can take my mike
sw: Simu nzuri. Unaweza ukachukua kipaza sauti changu

source: Ask the singer!!
sw: Muulize muimbaji!!!

source: I help injured people in burning buildings
sw: Mimi huwasaidia watu waliomia kuchoma nyumba

source: You are a very helpful person
sw: Wewe ni mtu msaidiaji sana

source: I would like a mike for announcements in the station
sw: Ningependelea kipaza sauti kwaajili ya matangazo katika kituo

source: Great sounding mike. You can take the medical box
sw: Kipaza sauti chenye sauti nzuri. Unaweza ukachukuya boksi la dawa

source: Ask the Emergency Person
sw: Muulize mtu wa huduma ya kwanza

source: I deliver parcels to people in the city
sw: Nina sambaza Mizigo kwa watu katika jiji

source: You get to meet and greet everyone
sw: Unatakiwa ukutane na kusalimia kila mmoja

source: I would like a medical box in case of emergency
sw: Ningependelea Boksi la dawa kwa tatizo lolote la ghafla

source: Thanks for the medical box. You can take the parcel
sw: Akhsante kwa boksi la sawa. Unaweza ukachukua mzigo

source: Ask the postman
sw: Muulize mtu wa posta

source: I am the manager of the bank
sw: Mimi ni meneja wa benki

source: You must be handling a lot of money
sw: Utakua unamiliki hela nyingi

source: An urgent parcel has come for me at the post office. Can you go and bring it?
sw: Mzigo wa haraka umekuja kwaajili yangu katika ofisi za posta. Unaweza kwenda kuuchukua?

source: This parcel has a lot of notes. You can take a note from there
sw: Huu mzigo una fedha za karatasi nyingi. Unaweza ukachukua fedha ya karatasi kutoka hapa.

source: Ask the manager
sw: Muulize meneja

source: I want to go home but I do not have money for the bus
sw: Ninahitaji kwenda nyumbani lakini sina nauli ya basi

source: Wait here. I will get you some money
sw: Subiri hapa. Nitakueletea kiasi fulani cha Fedha.

source: Please hurry. I want to go home before dark
sw: Tafadhali haraka. Nataka kwenda nyumbani kabla ya giza

source: You are a life saviour. Thank you!
sw: Wewe ni mwokozi wa Maisha. Akhsante!

source: Give the headphones to the postal clerk
sw: Mpe spika za masikioni karani wa posta

source: Pick up the post
sw: Chukua Posta

source: Give the post to the fireman
sw: Mpe posta Mtu wa zima moto

source: Pick up the fire extinguisher
sw: Chukua kizima moto

source: Give the fire extinguisher to the teller
sw: Mpe muhudumu wa benki kizima moto

source: Pick up the phone
sw: chukua simu

source: Give the phone to the singer
sw: Mpe muimbaji simu

source: Pick up the mike
sw: Chukua kipaza sauti

source: Give the mike to the emergency person
sw: mpe kipaza sauti mtu wa tatizo la ghafla

source: Pick up the medical box
sw: Chukua boksi la dawa

source: Give the medical box to the post man
sw: Mpe boksi la dawa mtu wa posta

source: Pick up the parcel
sw: Chukua Mzigo

source: Give the parcel to the bank manager
sw: Mpe mzigo meneja wa benki

source: Pick up the note
sw: chukua fedha ya karatasi

source: Give the note to the little girl
sw: Mpe msichana fedha ya karatasi

source: Congratulations! All tasks are done
sw: Hongera. Kazi zote zimeisha

source: This is my home
sw: hapa ni nyumbani kwangu

source: It is lovely. You seem very happy
sw: Inapendeza sana. Unaonekana mwenye furaha

source: You can take the towel
sw: Unaweza kuchukua taulo

source: Keep yourself dry with the towel
sw: Jikaushe kwa taulo

source: I look after the needs of this office
sw: ninaangalia mahitaji ya hii ofisi

source: You seem to be doing a great job
sw: unaonekana kufanya kazi nzuri
